[
  {
    "model": "django_summernote.attachment",
    "pk": 1,
    "fields": {
      "name": "b4a24e33b3bd654540968ef0cfce7d49.png",
      "file": "django-summernote/2022-06-22/5098383a-76da-4326-a370-4ee13785936a.png",
      "uploaded": "2022-06-22T07:48:19.050Z"
    }
  },
  {
    "model": "mainapp.articlecategory",
    "pk": 1,
    "fields": {
      "name": "Дизайн",
      "description": "Всё о дизайне",
      "is_deleted": false
    }
  },
  {
    "model": "mainapp.articlecategory",
    "pk": 2,
    "fields": {
      "name": "Веб-разработка",
      "description": "Всё о веб-разработке",
      "is_deleted": false
    }
  },
  {
    "model": "mainapp.articlecategory",
    "pk": 3,
    "fields": {
      "name": "Мобильная разработка",
      "description": "Всё о мобильной разработке",
      "is_deleted": false
    }
  },
  {
    "model": "mainapp.articlecategory",
    "pk": 4,
    "fields": {
      "name": "Маркетинг",
      "description": "Всё о маркетинге",
      "is_deleted": false
    }
  },
  {
    "model": "mainapp.articlecategory",
    "pk": 5,
    "fields": {
      "name": "Помощь",
      "description": "Раздел помощи",
      "is_deleted": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 1,
    "fields": {
      "category": 4,
      "author": 1,
      "title": "Где смотреть статистику Telegram-каналов и как анализировать показатели?",
      "image": "article_images\\f44cc4dc6294731d0362635e6cb60994.png",
      "description": "<div xmlns=\"http://www.w3.org/1999/xhtml\"><p>27 апреля&nbsp;<a href=\"https://tgstat.ru/\" rel=\"noopener noreferrer nofollow\">tgstat.ru</a>&nbsp;серьёзно обновился: дизайн стал приятнее, функционал — шире, аналитика — глубже. Если хотите не потеряться в куче метрик и делать объективные выводы исходя из данных о Telegram-каналах — это руководство должно помочь.</p><h3>Как посмотреть на все каналы определённой тематики?</h3><p>Предположим, что вам нужно оценить конкурентов в определённой нише. Тогда логичнее всего будет зайти на главную страницу TGStat, пролистать немного вниз и выбрать из списка категорий подходящую вам.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/747/706/79f/74770679fd4ee1a9e965870d8fe8bec2.webp\" alt=\"Вот так выглядит список доступных категорий Telegram-каналов в TGStat\" title=\"Вот так выглядит список доступных категорий Telegram-каналов в TGStat\" width=\"1496\" height=\"339\"><figcaption>Вот так выглядит список доступных категорий Telegram-каналов в TGStat</figcaption></figure><h3>Как найти определённый канал?</h3><p>Если хотите проанализировать какой-то конкретный канал — просто найдите вверху страницы строку для поиска и вставьте туда свою ссылку.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/17a/40d/f7b/17a40df7b43d98ec0598068fc3202481.webp\" alt=\"В самом верху страницы TGStat — поиск по каналам, чатам\" title=\"В самом верху страницы TGStat — поиск по каналам, чатам\" width=\"1498\" height=\"293\"><figcaption>В самом верху страницы TGStat — поиск по каналам, чатам</figcaption></figure><h3>Как анализировать данные из разных разделов TGStat?</h3><p>В первую очередь, после того как вы выбрали канал для анализа и провалились в него — нажмите на кнопку «Статистика», чтобы получить доступ к метрикам. И держите в голове правило:</p><blockquote><p>Нужно следить за контекстом, а не просто фиксировать изменения показателей. Находите объяснение каждому необычному выбросу. Иначе никак.</p></blockquote><p>А ещё важно учитывать, что&nbsp;<strong>TGStat отдельно считает просмотры для каждой картинки в посте — будьте внимательны.</strong></p><h3>Раздел «Сводная»</h3><p>Представляет из себя дашборд с основными показателями. Раздел удобно использовать для быстрого анализа состояния канала. Внутри «Сводной» можно найти такие чарты (графики и показатели):</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/2fb/19d/a46/2fb19da46760fb5581fbf11f3e7a8ac6.webp\" alt=\"Так выглядит сводный дашборд с данными о Telegram-канале в TGStat\" title=\"Так выглядит сводный дашборд с данными о Telegram-канале в TGStat\" width=\"1163\" height=\"703\"><figcaption>Так выглядит сводный дашборд с данными о Telegram-канале в TGStat</figcaption></figure><ul><li><p><strong>Подписчики.</strong>&nbsp;Показатель поможет оценить популярность канала и динамику изменения аудитории. Если видим плавный рост — скорее всего, над каналом работают правильно. Если видим резкий рост — предполагаем, что возможна накрутка. Если видим незначительное падение — не сильно переживаем. Если видим резкий отток аудитории — думаем по поводу прошедших накруток или резкого изменения формата канала.</p></li><li><p><strong>Подписки/отписки за 24 часа.</strong>&nbsp;Обращаем внимание на сильные выбросы. Если отписалось много людей в течение одного дня — смотрим на публикации, возможно, был выпущен пост на неудачную тему. Если видим взлёт подписок — возможно, канал заказывал в этот день рекламное размещение.</p></li><li><p><strong>Индекс цитирования.</strong>&nbsp;Если вы хотите оценить, насколько эффективно контент распространяется вирально — смотрите на этот показатель. Чем выше показатель, тем чаще публикации канал светится у других авторов.</p></li><li><p><strong>Средний охват 1 публикации.</strong>&nbsp;Полезно знать, чтобы оценивать, сколько людей в среднем видит посты канала. Косвенно указывает на вовлечённость аудитории в контент (через показатель ERR — о нём ниже).</p></li><li><p><strong>Средний рекламный охват 1 публикации.</strong>&nbsp;Это среднее число просмотров публикаций только внутри канала, без охватов с репостов. Метрика поможет более объективно оценить, сколько людей смотрят контент именно в этом канале.</p></li><li><p><strong>Возраст канала.</strong>&nbsp;Кажется, если взять несколько каналов с похожими показателями и посмотреть на их возраст, то можно выявить примерный временной диапазон, в рамках которого можно достигнуть определённых результатов по подписчикам, среднему охвату и т. п.</p></li><li><p><strong>Публикации.</strong>&nbsp;Глубокого смысла метрика не таит. Правда, она может подсказать, сколько постов стоит публиковать на вашем проекте. Для этого посмотрите на количество публикаций за месяц у ряда успешных конкурентов.</p></li><li><p><strong>Подписчиков читают посты канала (средний охват 1 публикации / количество подписчиков * 100%).</strong>&nbsp;С помощью показателя можно оценить, какая часть аудитории действительно активно следит за публикациями. В Telegram такая метрика обозначается как ERR.</p></li></ul><h3>Раздел «Подписчики»</h3><p>Здесь можно более детально определить, как изменялось число подписчиков с течением времени. Советую обратить внимание на выбросы — с их помощью можно определить, когда размещались успешные рекламные интеграции (рост числа подписчиков) или использовались неуместные темы в контенте (снижение числа подписчиков) .</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/36a/210/809/36a210809549ab749814664f0589d6a4.webp\" alt=\"Пример графика изменения числа подписчиков\" title=\"Пример графика изменения числа подписчиков\" width=\"1145\" height=\"378\"><figcaption>Пример графика изменения числа подписчиков</figcaption></figure><p>Теоретически, если взять несколько конкурентов из одной ниши и посмотреть на их графики изменения числа подписчиков — можно определить средний темп прироста для некоторых диапазонов подписчиков. Например, если у канала 10-25 тысяч подписчиков — его аудитория, в среднем, растёт на 1,2% в день. Так вы сможете заранее примерно спрогнозировать рост собственного канала на каждом из этапов продвижения.</p><h3>Раздел «Индекс цитирования»</h3><p>Кроме самого индекса, который отражает виральность контента, наверху страницы отмечено число упоминаний и репостов. Под «упоминанием» подразумевается появление где-то в Telegram логина вашего канала в формате «@example». А под репостом — пересылка отдельной публикации. Экспериментально, можно заложить более глубокую разницу между этими двумя понятиями:</p><ul><li><p>упоминание канала — появляется, когда человек считает, что упоминаемый канал регулярно публикует полезные и интересные материалы.</p></li><li><p>репост публикации — появляется, когда отдельная контентная единица понравилась подписчику канала.</p></li></ul><p>То есть,&nbsp;<strong>не рекламное упоминание является более «сильной» реакцией, чем репост</strong>&nbsp;— потому что указывает на постоянный сильный интерес ко всему каналу в целом. А репост — отражает интерес только к одной из публикаций канала.</p><p>Дополнительно упоминания исследуются внутри 4 чартов:</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/c76/09a/0a8/c7609a0a83e421a13255a9228395b528.webp\" alt=\"Основное содержание раздела «Индекс цитирования» в TGStat\" title=\"Основное содержание раздела «Индекс цитирования» в TGStat\" width=\"1116\" height=\"723\"><figcaption>Основное содержание раздела «Индекс цитирования» в TGStat</figcaption></figure><ul><li><p><strong>Упоминания по типу.</strong>&nbsp;Учитывается контекст упоминания. Индивидуальные — самые «сильные», потому что привлекают внимание только к вашему каналу. В подборки же канал может попадать просто для количества.</p></li><li><p><strong>Упоминания по количеству подписчиков.</strong>&nbsp;Чем более крупный канал вас упоминает — тем лучше. Особо глубоких выводов из этого чарта сделать не получится.</p></li><li><p><strong>Упоминания по тематикам.</strong>&nbsp;Чарт может быть полезен, если ваш канал размыт между несколькими направлениями. Посмотрев на распределение упоминаний можно примерно определить, какое тематическое направление наиболее заинтересовано в вашем контенте.</p></li><li><p><strong>Упоминание по странам.</strong>&nbsp;Ситуативна полезный чарт. Если для вас важна геолокация ваших наиболее вовлечённых пользователей — ориентируйтесь на чарт.</p></li></ul><h3>Раздел «Цитирование»</h3><p>На старте раздела есть схема, которая поможет определить, какие каналы чаще всего упоминают исследуемый канал (слева) и какие каналы чаще всего упоминаются самим исследуемым каналом (справа) . Как вариант, с её помощью можете определить, где вас любят больше всего и предложить коллаборацию.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/34a/7c3/4ce/34a7c34ce79b9e4612866edc29c5388b.webp\" alt=\"Пример схемы распределения упоминаний канала в TGStat\" title=\"Пример схемы распределения упоминаний канала в TGStat\" width=\"1139\" height=\"613\"><figcaption>Пример схемы распределения упоминаний канала в TGStat</figcaption></figure><p>Дополнительно можно посмотреть последние упоминания в каналах и чатах. Теоретически, это может быть полезно, если вы хотите оперативно приходить туда, где вас репостили и коммуницировать с аудиторией.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/6b4/1d0/b21/6b41d0b216e03e04e8b92f0987a18d8a.webp\" alt=\"Пример последних упоминаний канала\" title=\"Пример последних упоминаний канала\" width=\"1140\" height=\"381\"><figcaption>Пример последних упоминаний канала</figcaption></figure><h3>Раздел «Охваты публикаций»</h3><p>Вмещает в себя три чарта:</p><ul><li><p>Средний охват публикации.</p></li><li><p>Средний рекламный охват публикации.</p></li><li><p>Просмотры публикаций суммарно по дням.</p></li></ul><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/1e3/5f9/d6c/1e35f9d6c51ff938d22ee6d2f1b46b9c.webp\" alt=\"Пример графиков с изменением охватов и просмотров внутри канала\" title=\"Пример графиков с изменением охватов и просмотров внутри канала\" width=\"1172\" height=\"718\"><figcaption>Пример графиков с изменением охватов и просмотров внутри канала</figcaption></figure><p>О каждом из этих показателей рассказывал в разделе о «Сводной». Единственное дополнение: если посмотреть на просмотры публикаций суммарно по дням, при условии одинакового количество публикуемых постов, то можно выделить дни недели, в которые подписчики более активно взаимодействуют с каналом.</p><h3>Раздел «Анализ просмотров»</h3><p>Основная информацию отсюда — динамика просмотров постов по часам. С её помощью можно:</p><ul><li><p><strong>определить удачные часы для публикации.</strong>&nbsp;Например, если пост набирает больше 35% в первый час — считаем время публикации удачным. А если меньше — то пересматриваем время для постинга, чтобы уведомление от нашего канала не сбивалось конкурентами.</p></li><li><p><strong>выявить накрутку.</strong>&nbsp;Например, если за один час (не обязательно первый) пост набрал 80% просмотров — это подозрительно. Оцените регулярность таких странностей и сделайте выводы.</p></li></ul><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/487/4f8/330/4874f8330af0af69393967738a65e544.webp\" alt=\"Пример статистики просмотров по постам канала в TGStat\" title=\"Пример статистики просмотров по постам канала в TGStat\" width=\"1098\" height=\"549\"><figcaption>Пример статистики просмотров по постам канала в TGStat</figcaption></figure><h3>Раздел «Эффективность рекламы»</h3><p>Здесь отображаются те публикации, в которых были упомянуты сторонние каналы. Внимательно стоит смотреть на два параметра, которые помогут оценить эффективность рекламных постов:</p><ul><li><p><strong>просмотры.</strong>&nbsp;С ними всё понятно.</p></li><li><p><strong>прирост подписчиков.</strong>&nbsp;Показывает, на сколько подписчиков вырос рекламируемый канал за время жизни поста.</p></li></ul><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/8be/04f/1f6/8be04f1f6a2658de002c7348a9ec3811.webp\" alt=\"Пример статистики по рекламным размещениям в канале от TGStat\" title=\"Пример статистики по рекламным размещениям в канале от TGStat\" width=\"1096\" height=\"463\"><figcaption>Пример статистики по рекламным размещениям в канале от TGStat</figcaption></figure><h3>Раздел «Привлечение подписчиков»</h3><p>Поможет оценить, как канал привлекает трафик.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/b4b/9be/879/b4b9be8795fe5a2df05b7f46560a4ae6.webp\" alt=\"Пример таблицы из раздела «Привлечение подписчиков» в TGStat\" title=\"Пример таблицы из раздела «Привлечение подписчиков» в TGStat\" width=\"1039\" height=\"481\"><figcaption>Пример таблицы из раздела «Привлечение подписчиков» в TGStat</figcaption></figure><p>Есть такие данные:</p><ul><li><p>количество упоминаний канала за месяц.</p></li><li><p>суммарный месячный охват упоминаний.</p></li><li><p>прирост подписчиков.</p></li></ul><p>В зависимости от задачи, нужно смотреть на соотношение числа упоминаний канала и охвата или прироста подписчиков. Таким образом, можно будет косвенно оценить:</p><ul><li><p>как упоминания повлияли на популярность канала?</p></li><li><p>какой объём подписчиков удалось привлечь через упоминания?</p></li></ul><h3>Раздел «Внешний трафик»</h3><p>Может помочь понять, откуда идут переходы в исследуемый канал. Пример использования: смотрим распределение трафика по внешним источникам, выявляем перспективные и отстающие, оптимизируем бюджет на продвижение.</p><p>Есть важная оговорка:&nbsp;<strong>учитываются только те переходы, которые были осуществлены через редирект-сервис&nbsp;</strong><a href=\"https://ttttt.me/\" rel=\"noopener noreferrer nofollow\"><strong>ttttt. me</strong></a><strong>.</strong></p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/43f/389/ef9/43f389ef9cc7a11191edbc8c9f205efc.webp\" alt=\"Пример чартов в разделе «Внешний трафик»\" title=\"Пример чартов в разделе «Внешний трафик»\" width=\"1113\" height=\"680\"><figcaption>Пример чартов в разделе «Внешний трафик»</figcaption></figure><h3>Раздел «Топ публикаций»</h3><p>Раньше нельзя было составить топ публикаций и это очень бесило. Теперь же в TGStat можно не просто посмотреть самые просматриваемые посты, но и составить топы по пересылкам, репостам (пересылки без личных сообщений) , комментариям, реакциям.</p><figure class=\"\"><img src=\"https://habrastorage.org/getpro/habr/upload_files/91a/a7c/4b5/91aa7c4b597ed8da96f5f858029471ec.webp\" alt=\"Пример топа публикаций по реакциям\" title=\"Пример топа публикаций по реакциям\" width=\"427\" height=\"352\"><figcaption>Пример топа публикаций по реакциям</figcaption></figure><p>Ориентируясь на топовые публикации можно предположить, какие тематики и форматы лучше всего вовлекают аудиторию. Далее стоит попробовать их масштабировать и последить за результатами.</p><h3>Раздел «График публикаций»</h3><p>Может быть полезен, если вы хотите посмотреть, когда успешный конкурент публикует посты. Или хотите поэкспериментировать с собственным временем публикации контента.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/092/a54/ef0/092a54ef093e8db5bfc1f7f31dd27bfa.webp\" alt=\"Пример графика выхода публикаций\" title=\"Пример графика выхода публикаций\" width=\"863\" height=\"644\"><figcaption>Пример графика выхода публикаций</figcaption></figure><h3>Заключение</h3><p>TGStat серьёзно развился. Сейчас это сильнейшее решение для Telegram-аналитики с кучей возможностей. Но не забывайте главное правило:</p><blockquote><p>За показателями важно видеть смысл. Думайте не просто об изменении цифр, а о том почему они изменяются.</p></blockquote><p>Формулируйте правильные выводы, бережно относитесь к данным и работайте с умом.</p><p><em>А если вы хотите запустить контентный проект, разработать стратегию продвижения бренда в соцсетях или исследовать аудиторию — обращайтесь ко мне. Можно писать в&nbsp;</em><a href=\"https://t.me/tomilenkoman\" rel=\"noopener noreferrer nofollow\"><em>Telegram</em></a><em>, в&nbsp;</em><a href=\"https://vk.com/tomilenkoman\" rel=\"noopener noreferrer nofollow\"><em>ВКонтакте</em></a><em>&nbsp;или&nbsp;</em><a href=\"mailto:iktomilenko@gmail.com\" rel=\"noopener noreferrer nofollow\"><em>на почту</em></a><em>. Надеюсь, сработаемся)</em></p><p></p></div>",
      "create_date": "2022-06-17T14:32:33.446Z",
      "edit_date": "2022-06-25T16:47:06.309Z",
      "is_deleted": false,
      "is_published": false,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 2,
    "fields": {
      "category": 3,
      "author": 1,
      "title": "Интересности для жанра ARPG | Часть 2",
      "image": "article_images\\63083b0c5bf611fc94792e1566923ef8.jpg",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><p>Ещё одна подборка некоторых механик для применения в играх типа Diablo.</p><p><a href=\"https://habr.com/ru/post/465003/\" rel=\"noopener noreferrer nofollow\">Первая часть</a></p><h2>Концентрированное здоровье</h2><p>В диаблоидах мне изначально импонирует именно система расходуемых зелий. Не бесконечное зелье, не постоянный встроенный реген здоровья, не лечилки по кулдауну. Поэтому, ориентируясь на реализацию зелий в Diablo 1 и Diablo 2, хотелось бы иметь больше одного вида бутылки здоровья, но и не слишком много. А также немного разнообразить эти самые бутылки, чтобы не было так, что зелье А однозначно хуже зелья Б, а оно в свою очередь всегда хуже зелья В. Вернее сделать все виды бутылок более менее востребованными на любом этапе игры. Эти соображения привели к такой концепции:</p><p>Шкала здоровья получает дополнительный параметр - концентрация. Чем выше концентрация, тем насыщеннее цвет шкалы. Концентрация падает с течением времени. От текущей степени насыщенности шкалы здоровья зависит то, как она реагирует на выпитое зелье. Если насыщенность слабая, то здоровье восполняется с некоторой задержкой. Если насыщенность средняя, то здоровье восстановится мгновенно. Если насыщенность близка к предельным значениям, то выпитое зелье дополнительно вызывает эффект регенерации (фиксированное время или пока насыщенность не упадёт до средних значений).</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/60b/1c0/0b5/60b1c00b5c2d93015bcc7d09c24c39cc.jpg\" alt=\"Здоровье низкой концентрации, средней и высокой\" title=\"Здоровье низкой концентрации, средней и высокой\" width=\"654\" height=\"229\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/60b/1c0/0b5/60b1c00b5c2d93015bcc7d09c24c39cc.jpg\"><figcaption>Здоровье низкой концентрации, средней и высокой</figcaption></figure><p>Тогда сами зелья, допустим, их будет 3 вида - могут выглядеть следующим образом: простое зелье (не влияющее на концентрацию), среднее (незначительно повышает концентрацию) и сильноконцентрированное (значительно повышающее концентрацию). Таким образом сильноконцентрированные зелья не настолько необходимы, когда концентрации и так хватает - в такие моменты простые зелья становятся актуальнее. Для ещё более сильного сглаживания между степенью полезности различных зелий можно сделать так, что зелья попроще и здоровья прибавляют больше. Например, условно, простое зелье восполнит 50% шкалы, среднее 45%, а сильной концентрации - 40%.</p><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/cdb/0e3/177/cdb0e3177edf9d779f81d22dbd04bb21.jpg\" alt=\"Зелье без влияния на концентрацию, слабого влияния и сильного влияния\" title=\"Зелье без влияния на концентрацию, слабого влияния и сильного влияния\" width=\"507\" height=\"216\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/cdb/0e3/177/cdb0e3177edf9d779f81d22dbd04bb21.jpg\"><figcaption>Зелье без влияния на концентрацию, слабого влияния и сильного влияния</figcaption></figure><p>По аналогичному принципу могут работать и бутылки/шкала маны. </p><p>Для монстров и всяческих ловушек насыщенность шкалы тоже может являться одним из параметров, на которые они могут воздействовать. То есть какие-то монстры наносят повреждения, которые не влияют на концентрацию, а какие-то снижают её тоже. Определённые эффекты ловушек и вражеских заклинаний могут \"отравить\" концентрацию персонажа, тогда она будет падать намного быстрее. Либо временно \"заморозить\", мгновенно понизить её, \"проклясть\" героя (тогда любые зелья не дают концентрации, пока \"проклятие\" действует).</p><h2>Ресурсы вместо золота</h2><p>Здесь по сути имеется в виду разбиение единого универсального ресурса/валюты на отдельные, примерно равноправные виды (когда из этого планируется получить что-то новое для геймплея). То есть это может быть и вариант, с, допустим, делением единого золота на чёрное золото и белое золото. Или отсутствие золота как такового, но наличие каких-нибудь выполняющих его функцию цветных кристаллов - жёлтый, синий, зелёный и так далее.</p><p>Отсюда естественным образом вытекает, например, возможность крафта предметов: \"для создания предмета N нужны ресурсы A,B и E\". Если бы ресурс был единственный, золото, тогда подобный крафт смотрелся бы как покупка предмета у торговца.</p><p>Когда есть несколько ресурсов, то они вносят долю разнообразия в падающий с монстров лут. К тому же их можно закрепить за разными монстрами и прочими источниками сокровищ, чтобы добавить глубины игровому процессу - когда игроку нужен тот или иной вид ресурса, то он фокусируется на тех монстрах и источниках, которые его дают.</p><h2>Опыт не для персонажа</h2><p>Ввести в игру уровни персонажа - это универсальный хак, который всегда работает, легчайшим образом приносит чувство прогрессии и поддерживает интерес пользователя. Проблемы начинаются когда получение уровней затягивается, перестаёт на что-либо влиять или вовсе остановилось. Опять же в комплекте с подобной уровневостью практически всегда идёт линейность прохождения контента (а вот для того же жанра метроидваний, с нелинейным исследованием уровня и возвращениями в уже посещённые локации, уровневость персонажа как раз не обязательна, часто замещена какими-то находимыми усилениями, увеличением здоровья и собственно, новыми способностями), когда возврат в низкоуровневые места не имеет смысла.</p><p>Возможно, стоит вовсе убрать из игры уровни персонажа, сделать их незначительно влияющими на его параметры, сократить количество уровней или сделать систему \"перезагрузки\", которая так или иначе будет сбрасывать прогресс героя.</p><p>Также можно оставить некий получаемый опыт, но направить его не в получение уровней персонажа, а во что-то другое. Например раскачивать не героя, а его предметы и оружие, допустим, улучшая их в определённую сторону, затачивая в определённую стихию, увеличивая шансы попадания или просто приближая момент полного \"опознания\" предмета (когда выяснение свойств предмета происходит не от применения свитка, а именно раскрывается в процессе ношения предмета).</p><p>Предметами и оружием проще манипулировать, чем зашитыми в персонажа уровнями, параметрами и способностями. Они могут ломаться со временем, требовать подзарядки, не работать в определённым местах и ситуациях, против конкретных врагов. Одним словом - эти вещи относительно легко могут быть персонажем потеряны либо заменены, в то время как сбросить возможности зашитые в самого героя - более проблематично.</p><p>Получаемый опыт может быть направлен в ещё что-либо специфическое. Например, в получение неких ключей при каждом заполнении полоски, которыми в свою очередь можно открывать какие-то специальные сундуки, разбросанные по локациям. Одним словом, если нужны какие-то вещи, для которых запланирован постепенный гарантированный приход к игроку (в отличие от рандомного дропа с противников, который может долго не приносить нужных вещей или внезапно давать их слишком много), то можно привязать их получение к моментам накопления полоски опыта.</p><p>В роли специальных сундуков могут выступать и уже какие-то вскрытые игроком объекты, которые при первом осмотре дают какой-то дроп, раскрываясь не полностью, а по настоящему откроются уже при наличии у персонажа неизрасходованного ключа.</p><h2>Переселение душ</h2><p>Развитие предыдущего пункта, один из вариантов \"перезагрузки\" прогресса персонажа. Что если в качестве основного героя у нас будет некая душа, проживающая скоротечные жизни разных героев, теряющая при их смерти почти всё, но что-то и сохраняющая (хотя бы прогресс в исследовании локаций).</p><p>Персонаж, кстати, может тут вполне иметь стандартную уровневую прокачку, в то время как у самой души не будет уровней. Когда текущий персонаж умирает, то можно забыть про его уровни и про его лут - придётся искать другого. Возможно, сразу переселиться в какого-то заранее заготовленного или стандартного низкоуровневого. Возможно, побродить по окрестностям и вселиться в какое-то доступное тело поблизости.</p><p>При этом могут возникать дополнительные вопросы - насколько сильно стоит развивать эту сторону игры. Может быть дать душе выходить из тела в любой момент, подыскивая новые тела, и строить геймплей на этом. В таком случае, вероятно, посреди исследуемой местности могут быть некоторые преграды, через которые может пройти только душа, чтобы продвинуться дальше. То есть задача подконтрольного героя может заключаться в том, чтобы донести душу до очередной такой преграды, которую она сможет пересечь и найти себе нового носителя.</p><h2>ID-способности</h2><p>Систему заклинаний можно построить на том, чтобы герой находил особые камни, которые может складывать в различные комбинации, получая, например, активируемое заклинание из пары определённых установленных камней.</p><p>Это может быть реализовано через систему идентификаторов, которую я пару раз <a href=\"https://habr.com/ru/post/658443/\" rel=\"noopener noreferrer nofollow\">описывал ранее</a>. У каждого камня есть свой идентификатор, когда они участвуют в комбинации, то идентификаторы перемножаются и получаем, как минимум, 9 возможных исходов (по первой цифре результата - от 1 до 9). То есть, если герою доступно одно активируемое заклинание, которое получается от комбинации двух камней, то различные сочетания камней дадут 9 вариантов заклинаний - для простого диаблоида не так уж мало. Если у героя два доступных слота заклинаний (например, одно для левой кнопки мыши, другое для правой), то второе заклинание может иметь свои отдельные 9 вариантов и в сумме получится уже 18 заклинаний для героя (но в каждый момент времени он пользуется только двумя и из разных списков).</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/952/553/cc1/952553cc194b2090189084b0c7ea1ef6.jpg\" alt=\"Разные пары камней дают разные заклинания\" title=\"Разные пары камней дают разные заклинания\" width=\"655\" height=\"570\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/952/553/cc1/952553cc194b2090189084b0c7ea1ef6.jpg\" data-blurred=\"true\"><figcaption>Разные пары камней дают разные заклинания</figcaption></figure><p>Конечно, эту концепцию можно масштабировать в космические дали, если, например, брать первые две цифры от результата сочетания пары камней. Тогда камней с различными идентификаторами желательно добавить побольше, а вместо 9 исходов получится до 89 (числа от 10 до 99) возможных = 89 разных заклинаний. Но можно ограничиться более простым вариантом - до 9 вариантов заклинаний для каждого слота активного заклинания.</p><p>Пассивные способности могут регулироваться теми же камнями и слоты под них тоже могут иметь свои уникальные списки. То есть, допустим, может быть всего 9 доступных пассивных способностей, из которых выбираешь две. Или всего 18, но выбираешь первую пассивную способность из первых 9, и вторую из других 9.</p><p>Кроме определения вида заклинания, числа результатов комбинаций камней могут определённым образом влиять на что-то ещё. Например, на форму этого самого заклинания. То есть, имеем результат комбинации 2397, первое число устанавливает заклинание (например, 2 - это огонь), а второе число говорит о форме (например, 1,2,3 - это летящий шар, 4,5 - дыхание в конусе, 7,8 - фрагмент стены, 9,0 - расходящаяся волна).</p><p>Враги сами могут иметь идентификаторы и рассчитывать последствия взаимодействия с идентификатором каждого заклинания. К тому же их реакция может быть установлена случайной для каждой новой игры, тогда игроку понадобится выяснять, к чему уязвимы те или иные монстры в каждой конкретной игре.</p><p>Эффект воздействия на монстров может быть и общим для них всех, при этом случайным для новой игры, то есть когда в скелета прилетает файерболл, то их идентификаторы умножаются и получается результат, например, 723392. А в текущем глобальном эффекте воздействия первое число 7 означает, например, эффект замедления монстра. Тогда, все такие же файерболлы в этой текущей игре будут всегда замедлять движение скелетов. Если игрок найдёт другие заклинания и монстров, которые тоже при взаимодействии будут выдавать результат начинающийся на 7 - те монстры тоже будут замедляться от таких заклинаний.</p><p>В следующей игре, например, первая 7 в результатах взаимодействия заклинаний и монстров будет означать ваншот - мгновенное уничтожение рядового монстра. В то время как первая 2 - уже знакомое замедление, 4 - минимальные повреждения, 5 - эффект отбрасывания, 6 - кровотечение и так далее.</p><p>Воздействие эффектов на монстров может быть более тонким. Допустим, монстр запоминает первые две-три цифры каждого взаимодействия с заклинанием и \"хранит в памяти\" до 7 таких цифр. Тогда можно привязать какие-то эффекты к особенностям этой последовательности. Например, 3-ка \"злит\" монстра, если в этой последовательности накопится три цифры 3 (можно не подряд, а вобще), то монстр впадает в состояние берсерка. 5-ка, допустим, охлаждает конкретного монстра (пусть это будет некий стихийный элементаль, допустим, водяной) - две 5-ки в последовательности замедляют его, а три - замораживают. В то время как 8-ка того же монстра недраматически разогревает, то есть попавшие в последовательность 8-ки просто нивелируют охлаждающий эффект 5-ки. Или же разогревание тоже может быть драматическим, тогда две 8-ки разгонят элементаля, 3 сделают его кипящим, а 4 испарят. При этом каждая 5-ка тоже нейтрализует одну 8-ку. Ещё один монстр имеет волшебный щит. Допустим, три 7-ки отключают щит, после чего он открывается для эффекта двух 9-к, которые сразу убивают его. Таким образом можно развить эту систему, чтобы и сочетания заклинаний, последовательность их применения, играли роль - вроде того, что первым можно ослабить монстра и добить вторым.</p><h2>\"Органический\" инвентарь</h2><p>В различных диаблоидах и смежных с ними играх обычно фигурирует пара вариантов инвентаря - более \"классический\", когда предметы занимают разное количество клеток, и \"упрощённый\", где каждый предмет занимает одну ячейку.</p><p>Так вот, придумывая, как мог бы выглядеть инвентарь (трюм) у биомашинки, я вышел на концепцию некоей внутренней \"органической\" ёмкости, куда нужно компактно укладывать предметы, в то время как стенки этого контейнера прогибаются и деформируются, как бы обволакивая предметы. А когда предмет вынимается - некоторое время стенки контейнера сохраняют его форму.</p><p>Суть в следующем - у каждого предмета имеется некая зона влияния на окружающие ячейки инвентаря. От нулевой (тогда предмет занимает 1 ячейку), до 8 клеток (тогда предмет стремится занять все 8 примыкающих ячеек). Когда предмет перекладывается, то помещается в свободную ячейку (не занятую предметом или влиянием предмета), а на примыкающие ячейки распространяется зона его влияния - они становятся не пустыми и в них уже нельзя помещать предметы. Если предмет вынуть, его влияние с этих ячеек пропадает. Что всё это значит? По сути ничего нового - для того чтобы в инвентарь вошло больше предметов нужно перекладывать те, что уже там находятся, стараясь расположить зоны влияния предметов более экономным образом. Отличие в том, что такая перекладка выглядит менее квадратно-гнездовой и очевидной, более свободной, создающей впечатление именно засовывания вещей в рюкзак или мешок, таким образом, чтобы они расположились более компактно.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/51f/47c/e40/51f47ce403431269db1f5846f28feb60.jpg\" alt=\"Предмет слева имеет влияние на 3 клетки рядом с собой (выше, выше и правее и правую). Поместим два таких предмета в инвентарь размером 4 на 4 клетки. Тот, что в центре - занял 4 клетки, свою и те, что заблокированы теперь его влиянием. Предмет вверху занял всего одну клетку, так как его влияние не затронуло прочие ячейки. Если расположить центральный предмет левее или ниже того, что в углу, то его влияние тоже частично уйдёт за пределы инвентаря, частично &quot;наложится&quot; на занятую другим предметом клетку. \" title=\"Предмет слева имеет влияние на 3 клетки рядом с собой (выше, выше и правее и правую). Поместим два таких предмета в инвентарь размером 4 на 4 клетки. Тот, что в центре - занял 4 клетки, свою и те, что заблокированы теперь его влиянием. Предмет вверху занял всего одну клетку, так как его влияние не затронуло прочие ячейки. Если расположить центральный предмет левее или ниже того, что в углу, то его влияние тоже частично уйдёт за пределы инвентаря, частично &quot;наложится&quot; на занятую другим предметом клетку. \" width=\"580\" height=\"339\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/51f/47c/e40/51f47ce403431269db1f5846f28feb60.jpg\" data-blurred=\"true\"><figcaption>Предмет слева имеет влияние на 3 клетки рядом с собой (выше, выше и правее и правую). Поместим два таких предмета в инвентарь размером 4 на 4 клетки. Тот, что в центре - занял 4 клетки, свою и те, что заблокированы теперь его влиянием. Предмет вверху занял всего одну клетку, так как его влияние не затронуло прочие ячейки. Если расположить центральный предмет левее или ниже того, что в углу, то его влияние тоже частично уйдёт за пределы инвентаря, частично \"наложится\" на занятую другим предметом клетку. </figcaption></figure><p>К этой концепции можно прийти просто программируя инвентарь \"классического\" диаблоида - там на самом деле работает схожий принцип, просто правила немного другие. Перемещаемый предмет обладает такой же зоной влияния, но распространяющейся не вокруг, а вправо в вниз от корневой ячейки. Кроме этого там предмет не может быть перемещён, если в эту зону влияния хотя бы что-то попадает - она вся должна быть не занята. В \"органическом\" инвентаре, напротив, неважно, что окажется в зоне влияния - предмет может быть установлен в любую свободную ячейку, не занятую предметами или влиянием других предметов.</p><h2>Примеры реализации</h2><p>Пользуясь фреймворком PlayCanvas я задумал собрать прототип простенького диаблоида, в том числе использовав там некоторые задумки из первой части механик для ARPG.</p><p>Замечу, что условным эталонным диаблоидом лично для меня является всё-таки первая Diablo, притом консольная версия, где двигаться нужно было стрелочками, а не мышкой. Поэтому диаблоиды на ПК мне обычно не слишком нравятся (включая D1 и D2) уже хотя бы по причине просто сумасшедшей нагрузки на мышь (вернее на кисть правой руки, бог с ней  с мышью), с этими микроприцеливаниями во всё подряд. Руки должны быть равномерно загружены, а мышь должна знать своё место. Допустим, в League of Legends (путь это и не диаблоид) мышь используется довольно интенсивно, но сверхточные клики мышью не требуются, а нагрузка более менее распределена по обоим рукам, в то время как от управления Path of Exile и прочих \"классических\" представителей arpg жанра устаёшь довольно быстро. </p><p>Конечно, у первой Diablo много своих недостатков, например, на той же консоли было сложно заходить в инвентарь, устанавливать заклинания, сохраняться/загружаться, покупка товаров через список довольно неудобна, ещё какие-то мелочи. Но уже ко 2-й части многое хорошее куда-то выветрилось и более не возвращалось в серию. Например, сама концепция исследования подземелий/этажей, что мне очень нравится, в отличие от беготни по всяким полупустым полям/степям с заходами в неглубокие (как новосибирское метро) мини-подземельями. Магические книжки находить интереснее, чем тыкать фиксированные навыки в дереве прокачки. Нет такого огромного перегруза лишними вещами/параметрами/союзниками, как в D2. Одним словом, при всех несовершенствах интерфейса, сама базовая формула первой Diablo мне как-то больше импонирует и если на что и хотелось ориентироваться, то куда-то в ту сторону.</p><p>Итак, проект <strong>Chaosborn</strong>. Сюжет (если это можно назвать сюжетом) в том, что герой просыпается/воскресает в некоем подземелье, выбираясь из саркофага. И начинает свой путь по подземелью, постепенно выбираясь на этажи повыше.</p><div class=\"embed_link\"><div class=\"embed__thumb\" style=\"background-image: url(&quot;https://img.itch.zone/aW1nLzc0MjM3MTIuanBn/original/SwhJX1.jpg&quot;);\"></div><div class=\"embed__caption\"><div class=\"embed__caption-title\"><span>Chaosborn</span></div><a href=\"https://thenonsense.itch.io/chaosborn\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"embed__caption-link\">thenonsense.itch.io</a></div></div><iframe frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" src=\"https://embedd.srv.habr.com/iframe/62ac77f5de22274fb4bad9d7\" style=\"\" width=\"\" id=\"62ac77f5de22274fb4bad9d7\" height=\"398\"></iframe><p>Здесь я ориентировался на упоминавшуюся в <a href=\"https://habr.com/ru/post/465003/\" rel=\"noopener noreferrer nofollow\">первой части arpg-интересностей</a> концепцию внеземной пирамиды, по этажам которой герой продвигается не вниз, а вверх. Также герой не привязан к некоей базе, типичной для диаблоидов - некуда вернуться и продать/купить предметы. Тем не менее, он может разбирать находимые им вещи на фрагменты. Чтобы позднее из фрагментов собирать какие-то полезности, например, те же зелья маны/жизни. Для сборки нужны свитки с рецептами. Вернее я сделал таким образом, что все рецепты доступны сразу (хотя в демо их доступно мало), в отдельном меню, но поначалу закблокированы, а открывать их можно за такую валюту как универсальные свитки (редкий дроп с монстров и прочих источников лута).</p><p>Концепция с душами здесь тоже присутствует и выглядит следующим образом: путешествуя по подземелью герой иногда находит прочие саркофаги, в которых кто-то лежит (помимо тех, из которых просто выпадает лут). Если герой умирает, то игрок переносится в одного из ранее найденных героев, которые воскресают в своих саркофагах. У них свой пустой инвентарь, но накопленные фрагменты, свитки и разблокированные рецепты переносятся, плюс начисляется некоторое количество бонусных фрагментов.</p><p>Используются зелья маны и здоровья, по одному виду бутылок для каждого ресурса. Применяются нажатием на символизирующие их кнопки - расходуется первая попавшаяся бутылка такого типа в инвентаре.</p><p>Предметы экипировки сделаны простыми, без дополнительных свойств, с фиксированными бонусами. Это несколько разновидностей предметов для слота маски, для слота артефакта и в слот кольца.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/42c/b45/e5c/42cb45e5c7cc88e40824bfaeb1a4c9da.jpg\" alt=\"Открытый инвентарь и слоты экипировки.\" title=\"Открытый инвентарь и слоты экипировки.\" width=\"956\" height=\"664\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/42c/b45/e5c/42cb45e5c7cc88e40824bfaeb1a4c9da.jpg\" data-blurred=\"true\"><figcaption>Открытый инвентарь и слоты экипировки.</figcaption></figure><p>Что касается оружия - с ним всё сложнее. Герой у нас в целом чисто маг (да, вот так вот ультимативно - ну нравится мне играть в диаблоиды исключительно магами и прочими подходящими на их роль) и может стрелять простеньким слабым заклинанием без всяких проблем и без траты маны, правда оно очень медленно и недалеко летит. Если экипировать специальное хаотическое оружие, то выстрелы становятся более мощными, но расходуют ману. При этом выстрелы каждого конкретного хаотического оружия видоизменяются, в зависимости от скрытых внутри него комбинаций - наносят урон разными \"стихиями\", ускоряются, замедляются, становятся двойными, расходуют больше/меньше маны, замедляют или поджигают врагов.</p><p>При уничтожении врагов из них вылетают недолговечные искры, если поймать такую искру, то она втянется текущим экипированным хаотическим оружием, заняв одну из 9 его ячеек. Каждая вертикальная колонка из ячеек отвечает за какое-то свойство (модификатор) выстрела. Всего у выстрела 3 модификатора, они поочерёдно открываются и меняются по мере накопления оружием искр. Таким образом, побегав с оружием какое-то время, лишаешь его скрытых тайн и хаотичности, фиксируя эффекты. Но это ещё не всё, после накопления искр через некоторое количество выстрелов хаотическое оружие ломается, оставляя кристаллы-заряды определённой стихии.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/b51/9a6/66c/b519a666c5d9e630156206027600d11b.jpg\" alt=\"Справа внизу видно, что в текущем оружии собрано 4 искры.\" title=\"Справа внизу видно, что в текущем оружии собрано 4 искры.\" width=\"956\" height=\"664\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/b51/9a6/66c/b519a666c5d9e630156206027600d11b.jpg\" data-blurred=\"true\"><figcaption>Справа внизу видно, что в текущем оружии собрано 4 искры.</figcaption></figure><p>Что же это за заряды такие? Дело в том, что имеется ещё такой вид оружия как жезлы. Если экипировать жезл, то он постреливает встроенной слабой магией, которая не тратит маны. Но в жезл также встроены пара заклинаний (огненный шар и молнии), которые расходуют не ману, а те самые кристаллы-заряды. Таким образом предполагается, что игрок периодически экипирует герою хаотическое оружие, ловит в него искры, а когда то оружие разрушается, то может иногда постреливать из жезла накопившимися зарядами.</p><p>По сути в хаотическом оружии как раз действует система умножения идентификаторов, но в несколько упрощённом виде. Также это похоже на концепт <strong>Куба с дарами</strong> из первой статьи, однако тот Куб планировался как вариант полной замены инвентаря вобще, в то время как в этом проекте мне захотелось иметь более развёрнутого (классического) вида инвентарь и концепцию Куба пришлось несколько переделать.</p><p>В другом прототипе, <strong>Wild Engines</strong>, используется концепт <strong>ID-способностей</strong> - машинка подбирает в свой ограниченный инвентарь-рулетку разные предметы и, в зависимости от выставленной комбинации первых двух предметов, получает то или иное активируемое заклинание. Играбельное демо с этой механикой я пока не собирал, а в старой демоверсии этого проекта такой механики ещё нет. В целом это заготовка под такой некоторый \"диаблоид на колёсах\". Кто сказал, что машинки не могут быть магами и зачищать \"подземелья\"?</p><iframe frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" src=\"https://embedd.srv.habr.com/iframe/62ac76a05bce1f4fead98771\" style=\"\" width=\"\" id=\"62ac76a05bce1f4fead98771\" height=\"398\"></iframe><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/479/10b/4b6/47910b4b66a68f220bcb3e68f9168edf.jpg\" alt=\"В инвентаре-рулетке справа выставлена комбинация предметов (верхнее поле), дающая машинке способность дышать огнём. Кнопки по бокам вертят колонки предметов. Кнопки внизу выкидывают предметы из соответствующей колонки в игровой мир (кроме самого верхнего предмета). Подбираемые предметы помещаются в свободные позиции инвентаря-рулетки (но не в верхние поля, куда предмет можно только прокрутить боковыми кнопками).\" title=\"В инвентаре-рулетке справа выставлена комбинация предметов (верхнее поле), дающая машинке способность дышать огнём. Кнопки по бокам вертят колонки предметов. Кнопки внизу выкидывают предметы из соответствующей колонки в игровой мир (кроме самого верхнего предмета). Подбираемые предметы помещаются в свободные позиции инвентаря-рулетки (но не в верхние поля, куда предмет можно только прокрутить боковыми кнопками).\" width=\"1019\" height=\"593\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/479/10b/4b6/47910b4b66a68f220bcb3e68f9168edf.jpg\" data-blurred=\"true\"><figcaption>В инвентаре-рулетке справа выставлена комбинация предметов (верхнее поле), дающая машинке способность дышать огнём. Кнопки по бокам вертят колонки предметов. Кнопки внизу выкидывают предметы из соответствующей колонки в игровой мир (кроме самого верхнего предмета). Подбираемые предметы помещаются в свободные позиции инвентаря-рулетки (но не в верхние поля, куда предмет можно только прокрутить боковыми кнопками).</figcaption></figure><p>Ещё один прототип, <strong>Neverdrome</strong> (на этот раз с демоверсией), демонстрирует работу упоминаемого в статье <strong>Органического инвентаря</strong> (хотя он тут довольно малого размера). Там присутствует ещё одна особенность - влияние предмета снимается немного упрощённым алгоритмом и иногда возникает эффект освобождения лишнего места, поэтому не только порядок укладки, но и последующие перекладки предметов тоже начинают играть свою роль.</p><div class=\"embed_link\"><div class=\"embed__thumb\" style=\"background-image: url(&quot;https://img.itch.zone/aW1nLzkxNDUyODMuanBn/original/9uBFCf.jpg&quot;);\"></div><div class=\"embed__caption\"><div class=\"embed__caption-title\"><span>Neverdrome</span></div><a href=\"https://thenonsense.itch.io/neverdrome\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"embed__caption-link\">thenonsense.itch.io</a></div></div><iframe frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" src=\"https://embedd.srv.habr.com/iframe/62ac83e141d6a34fa4f7f1fd\" style=\"\" width=\"\" id=\"62ac83e141d6a34fa4f7f1fd\" height=\"398\"></iframe><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/ad2/75e/fe0/ad275efe0952d77ab0a41a46fce45548.jpg\" alt=\"В окне инвентаря (9 ячеек слева) находятся два предмета с полной областью влияния (на все 8 окружающих их клеток). Ячейки заблокированные их областями влияния отмечены &quot;паутиной&quot;.\" title=\"В окне инвентаря (9 ячеек слева) находятся два предмета с полной областью влияния (на все 8 окружающих их клеток). Ячейки заблокированные их областями влияния отмечены &quot;паутиной&quot;.\" width=\"1017\" height=\"594\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/ad2/75e/fe0/ad275efe0952d77ab0a41a46fce45548.jpg\" data-blurred=\"true\"><figcaption>В окне инвентаря (9 ячеек слева) находятся два предмета с полной областью влияния (на все 8 окружающих их клеток). Ячейки заблокированные их областями влияния отмечены \"паутиной\".</figcaption></figure><p> Ну и на этом всё на сегодня.</p><p></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-16T14:32:33.446Z",
      "edit_date": "2022-06-17T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 3,
    "fields": {
      "category": 1,
      "author": 1,
      "title": "Функциональная спецификация интерфейса: что это, зачем нужна, как её писать",
      "image": "article_images\\e6651a94c382844ffc6b4929fe85f705.png",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><p>Функциональная спецификация вместе с прототипом рассказывает, из каких элементов состоит и как работает интерфейс системы. Она описывает то, что трудозатратно, невозможно или бессмысленно показывать в прототипе.</p><p>С её помощью можно улучшить предлагаемые решения, ответить на вопросы разработчиков и других участников проекта, зафиксировать договорённости на бумаге.</p><p>В этой статье я рассказал, как она помогает сделать продукт лучше, что можно включить в спецификацию, как её структурировать, что писать об отдельных элементах интерфейса и что уже выходит за рамки подобного документа.</p><p>Надеюсь, это поможет вам в написании спецификаций для своих интерфейсов.</p><a class=\"anchor\" name=\"0\" id=\"0\"></a><h2>Оглавление</h2><p><a href=\"#1\" rel=\"noopener noreferrer nofollow\">1. Что такое функциональная спецификация</a></p><p><a href=\"#2\" rel=\"noopener noreferrer nofollow\">2. Зачем нужна</a></p><p><a href=\"#3\" rel=\"noopener noreferrer nofollow\">3. Как писать</a></p><p><a href=\"#3.1\" rel=\"noopener noreferrer nofollow\">3.1. Когда к ней приступать</a></p><p><a href=\"#3.2\" rel=\"noopener noreferrer nofollow\">3.2. Состав</a></p><p><a href=\"#3.3\" rel=\"noopener noreferrer nofollow\">3.3. Структура</a></p><p><a href=\"#3.4\" rel=\"noopener noreferrer nofollow\">3.4. Описание элементов</a></p><p><a href=\"#3.5\" rel=\"noopener noreferrer nofollow\">3.5. Описание страниц</a></p><p><a href=\"#4\" rel=\"noopener noreferrer nofollow\">4. Примечания и ссылка на видео</a></p><a class=\"anchor\" name=\"1\" id=\"1\"></a><h2>Что такое функциональная спецификация</h2><p>Функциональная спецификация интерфейса — один из артефактов, который полезно создавать при проектировании интерфейсов. Я её делаю после прототипа, чтобы уточнить показанные в нём решения и ответить на будущие вопросы разработчиков.</p><p>Итоговый документ работает в паре с прототипом и рассказывает, из каких элементов состоит и как работает интерфейс системы. В нём можно описать то, что трудозатратно или невозможно визуализировать в прототипе, и то, что на картинках человек скорее всего не заметит.</p><p>Например:</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/12f/14c/651/12f14c651cedc67f56bc038ff9579156.png\" alt=\"1. Приложение сигнализации, список пользователей\" title=\"1. Приложение сигнализации, список пользователей\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/12f/14c/651/12f14c651cedc67f56bc038ff9579156.png\"><figcaption>1. Приложение сигнализации, список пользователей</figcaption></figure><p>Разработчики спросят, как упорядочен список пользователей? На картинке ответа нет. Я решил, что упорядочены они по дате и времени подключения, поэтому в спецификации надо написать:</p><ol><li><p>Пользователи упорядочены по дате и времени регистрации на объекте в прямом хронологическом порядке.</p></li><li><p>Доверенные лица упорядочены по дате и времени добавления в прямом хронологическом порядке.</p></li></ol><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/8d8/033/f3d/8d8033f3d0e551ad12f0b0d2b020f904.png\" alt=\"2. Приложение сигнализации, настройка тегов местоположения\" title=\"2. Приложение сигнализации, настройка тегов местоположения\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/8d8/033/f3d/8d8033f3d0e551ad12f0b0d2b020f904.png\"><figcaption>2. Приложение сигнализации, настройка тегов местоположения</figcaption></figure><p>На картинке со списком тегов — реалистичные данные. Из них следует, что список упорядочен в прямом алфавитном порядке. Но разработчики могут не обратить на это внимания. И вообще не факт, что подобную информацию они станут искать в прототипе. Значит, в спецификации стоит написать:</p><ol><li><p>Теги упорядочены в прямом алфавитном порядке.</p></li></ol><p>Функциональная спецификация интерфейса — не техническое задание на создание продукта. Она описывает только логику работы отдельных элементов интерфейса и их совокупностей (страниц, экранов). Техническое задание может содержать важные характеристики продукта: производительность, на каких устройствах и операционных системах он должен работать без нареканий, требования к вёрстке и так далее.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/3a5/e83/1d5/3a5e831d5689b1959c931262b8a42ceb.png\" alt=\"3. Приложение сигнализации, установка пинкода на вход\" title=\"3. Приложение сигнализации, установка пинкода на вход\" width=\"320\" height=\"549\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/3a5/e83/1d5/3a5e831d5689b1959c931262b8a42ceb.png\"><figcaption>3. Приложение сигнализации, установка пинкода на вход</figcaption></figure><p>В приложении можно управлять сигнализацией, поэтому вход в него полезно защитить пинкодом. Это обязательно, если пользовательский телефон сам пинкодом не защищён (раньше такое часто встречалось). А если защищён, отображается кнопка «Не устанавливать код на вход», и шаг установки пинкода не обязателен. Эта логика может быть описана в спецификации:</p><ol><li><p>Установка пинкода на вход в приложение происходит после регистрации пользователя на объекте, если пользователь приложения не пропустил этот шаг или не установил пинкод ранее.</p></li><li><p>Если телефон не защищён пинкодом, пользователь не может пропустить этот шаг, кнопка «Не устанавливать код на вход» не отображается.</p></li></ol><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/aa0/e17/8cd/aa0e178cdd5134777de29b98cd8489ed.png\" alt=\"4. Приложение сигнализации, меню со списком объектов\" title=\"4. Приложение сигнализации, меню со списком объектов\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/aa0/e17/8cd/aa0e178cdd5134777de29b98cd8489ed.png\"><figcaption>4. Приложение сигнализации, меню со списком объектов</figcaption></figure><p>Пользователь может зарегистрироваться на нескольких объектах, тогда в приложении появится список, чтобы переключаться между ними. От названий объектов в списке отображаются только первые буквы: «Квартира» → «К», «Дача» → «Д», «Гараж» → «Г». А от названий, начинающихся одинаково, — буквы с порядковыми номерами: «К1», «К2» и «К3».</p><p>Сложно с помощью одних лишь картинок передать это решение и ответить на вопрос: что будет с порядковыми номерами, когда пользователь отключится от объекта, обозначенного «К1»? Возможно, обозначения «К2» и «К3» стоит сохранить за оставшимися объектами, так как человек мог к ним привыкнуть. В спецификации это можно описать:</p><ol><li><p>Если у пользователя приложения несколько объектов с названиями на одну и ту же букву, отображаются буквы и порядковые номера. Номера присваиваются по мере регистрации пользователя на этих объектах. Например, «К1», «К2» и «К3» — это объекты, названия которых начинаются с буквы «К». Сначала пользователь зарегистрировался на «К1».</p></li><li><p>Если пользователь отключается от «К1», обновлять порядковые номера не надо, чтобы за оставшимися объектами сохранились привычные пользователю обозначения «К2» и «К3».</p></li></ol><p>Кстати, на этом примере можно проиллюстрировать два полезных приёма: 1) дополнять тезисы примерами, чтобы было понятнее, 2) кратко объяснять не самые очевидные решения. Об этом стоило написать в разделе «Как писать функциональную спецификацию», но здесь уж очень удобный пример подвернулся.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"2\" id=\"2\"></a><h2>Зачем нужна функциональная спецификация</h2><p>1. Донести решения, которые не видны в прототипе.</p><p>2. Стать источником ответов на возможные вопросы разработчиков, тестировщиков, менеджеров и других людей, которые будут работать с прототипом. Без такого источника они будут спрашивать дизайнера и откладывать задачи, пока ответов нет. Или придумывать свои ответы и делать как-нибудь (и потом, в лучшем случае, переделывать). Дизайнер может уйти из компании, а в заказной разработке — сдать свой этап работ и забыть детали проекта или просто перестать отвечать на вопросы.</p><p>Спецификация нужна при разработке любых более-менее сложных интерфейсов. Полезной она будет даже для лендинга, если на нём есть калькулятор, конфигуратор или форма заказа.</p><p>3. Стать частью договора. В отличие от интерактивного прототипа спецификацию легко распечатать и подписать. Фиксировать договорённости полезно не только с внешними контрагентами, но и с собственными коллегами. Внутри команды без такого договора тоже иногда бывает тяжко. Особенно удобно, если можно видеть, кто прочитал документ и задал вопросы.</p><p>4. Проверить свои решения ещё раз. Разные артефакты проектирования можно сравнить с разным размером ячеек в сите, с помощью которого просеиваются проектные решения. Прототип — крупная ячейка, выявляющая большие недочёты в логике работы проектируемой системы. Спецификация — мелкая ячейка, помогающая найти недочёты небольшие.</p><p>Примеры доработки решений, показанных в прототипе:</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/021/a85/961/021a85961ac600e2120d792c5b551f96.png\" alt=\"5. Приложение сигнализации, вход\" title=\"5. Приложение сигнализации, вход\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/021/a85/961/021a85961ac600e2120d792c5b551f96.png\"><figcaption>5. Приложение сигнализации, вход</figcaption></figure><p>Чтобы войти в приложение, некоторым пользователям приходится вводить пинкод. При описании кнопки «Войти» я отвечаю на вопросы: надо ли её блокировать по умолчанию; как отреагирует система на нажатие, если пинкод не введён? При этом может появиться мысль: зачем нужна кнопка, если пускать в приложение можно сразу после ввода корректного пинкода? Стоит убрать кнопку и описать это поведение в спецификации.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/41c/2b9/4d2/41c2b94d22b01769fd8001372b2b0bc7.png\" alt=\"6. Приложение сигнализации, подтверждение номера телефона\" title=\"6. Приложение сигнализации, подтверждение номера телефона\" width=\"320\" height=\"549\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/41c/2b9/4d2/41c2b94d22b01769fd8001372b2b0bc7.png\"><figcaption>6. Приложение сигнализации, подтверждение номера телефона</figcaption></figure><p>Пользователь подтверждает номер телефона, который он указал на предыдущем шаге. Описывая абзац с номером телефона, я вспоминаю, зачем вообще решил его показывать? Чтобы можно было проверить, нет ли ошибки в номере, если смс долго не приходит. Может возникнуть вопрос: а если номер неправильный, как это исправить? Нужна возможность изменить номер или вернуться на предыдущий шаг.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/6bc/386/940/6bc386940ee64e4cfad59c25be5bab20.png\" alt=\"7. Приложение сигнализации, пустой список пользователей и доверенных лиц\" title=\"7. Приложение сигнализации, пустой список пользователей и доверенных лиц\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/6bc/386/940/6bc386940ee64e4cfad59c25be5bab20.png\"><figcaption>7. Приложение сигнализации, пустой список пользователей и доверенных лиц</figcaption></figure><p>Я показал состояние с пустым списком пользователей на конкретном объекте. Пересматривая юзерфлоу (user flow) первоначальной настройки сигнализации, я понимаю, что главный пользователь появляется ещё до завершения настройки нового объекта. Значит, он уже должен быть в этом списке. Надо исправить.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/fbe/af4/e1f/fbeaf4e1fab00c2e36a43195274713c8.png\" alt=\"8. Приложение сигнализации, настройка уведомлений\" title=\"8. Приложение сигнализации, настройка уведомлений\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/fbe/af4/e1f/fbeaf4e1fab00c2e36a43195274713c8.png\"><figcaption>8. Приложение сигнализации, настройка уведомлений</figcaption></figure><p>Пользователь указывает, как хотел бы узнавать о сработавшей сигнализации: с помощью пуша, смс, имейла или всеми возможными способами. Прорабатывая уведомления по электронной почте, разработчики спросят, на какой адрес отправлять письмо? При регистрации пользователь вводит только номер телефона, значит, при выборе этого способа оповещения должно появляться поле для ввода адреса почты. Плюс, адрес надо ещё подтвердить, а до этого уведомление по электронной почте работать не будет (надо показать ещё одно состояние).</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3\" id=\"3\"></a><h2>Как писать функциональную спецификацию</h2><a class=\"anchor\" name=\"3.1\" id=\"3.1\"></a><h3>Когда к ней приступать</h3><p>Я начинаю писать спецификацию после появления финальной версии прототипа. На этапе прототипирования видение продукта может сильно меняться. И если в прототипе поменять всё относительно просто, то переписывать текст уже не так легко. Части экранов вообще может не оказаться в новой итерации прототипа — есть опасность стереть строк больше, чем выдал. В заказной разработке даже оценивать стоимость написания спецификации лучше после создания прототипа.</p><p>Стоит учитывать, что после прототипа появятся дизайн-макеты, которые конкретизируют дизайн. Например, количество превьюшек в галерее. Прототип покажет их количество приблизительно, так как оно зависит от системы отступов, конкретных размеров картинок и самой галереи, которые будут определены уже в макетах.</p><p>Если основная задача спецификации — ещё раз проверить и улучшить свои решения, можно написать что-то вроде «Кнопки для прокрутки списка превью отображаются, если изображений в галерее больше N (количество определяется на этапе дизайна)». Если главное — договориться и подготовить проект к разработке, спецификацию придётся обновить после создания дизайн-макетов. Или можно отложить её написание до появления финальных макетов.</p><p>С другой стороны, одновременно с прототипированием в спецификации можно фиксировать отдельные решения (чтобы не вспоминать потом) и записывать открытые вопросы.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.2\" id=\"3.2\"></a><h3>Состав</h3><p>Базовый состав спецификации:</p><ul><li><p>Титульный лист.</p></li><li><p>Оглавление.</p></li><li><p>Описания типовых элементов интерфейса:</p><ul><li><p>Для продукта в целом.</p></li><li><p>Для его разделов или модулей.</p></li></ul></li><li><p>Описания отдельных страниц (экранов, блоков на длинных страницах). Для каждой страницы:</p><ul><li><p>Её работа в целом.</p></li><li><p>Состав и поведение её элементов.</p></li><li><p>Модальные окна, сообщения об ошибках, особые случаи.</p></li></ul></li></ul><p>Выделение типовых элементов позволяет не дублировать описания одних и тех же элементов на разных страницах. Типовыми для продукта в целом бывают: шапка, главное меню, подвал, поле поиска, форма подписки на рассылку, лайтбокс просмотра галереи, капча, подсказка и так далее. Для отдельного модуля вроде новостного раздела: меню раздела, блок «Самые популярные новости».</p><p>Можно добавить:</p><ul><li><p>Введение и общее описание продукта.</p></li><li><p>Описания основных сущностей продукта и определения терминов из предметной области. Например, для конфигуратора одежды, который появится в примерах ниже: нанесение, область нанесения.</p></li><li><p>Определения технических терминов из спецификации. Например: контрол, лайтбокс, алерт, внешняя часть системы.</p></li><li><p>Структуры конкретных разделов или модулей продукта.</p></li><li><p>При описании отдельной страницы:</p><ul><li><p>Зачем она вообще нужна, какую задачу решает. Даже краткое описание в 1–2 предложения может оказаться очень полезным.</p></li><li><p>Изображение её основного состояния.</p></li><li><p>Изображения всех её состояний.</p></li></ul></li></ul><p>Межэкранную логику в спецификации лучше не описывать. Для этого больше подходят сценарии и, если логика разветвлённая, диаграммы юзерфлоу.</p><p>Что добавлять в спецификацию, зависит от того, кто и как будет ей пользоваться, и готов ли дизайнер такое содержимое подготовить. Документ с изображениями лучше решает задачу «Стать частью договора» и позволяет ознакомиться с проектом, не открывая прототипа. Описание продукта в целом, его основных сущностей и смысла отдельных страниц упрощает подключение новых людей к работе над продуктом. Словарь терминов помогает всем говорить на одном языке.</p><p>Идеально, если все состояния прототипа показаны в спецификации картинками. Можно не перелинковывать её с прототипом, и читателям не придётся изучать два артефакта параллельно. Но это трудоёмко, и без интерактивного прототипа всё равно не обойтись — сложнее оценивать удобство интерфейса.</p><p>Можно писать спецификацию в прототипе (в Акшуре или Фигме), но работать с текстом в подобных средах сложнее, чем в текстовом редакторе. И нельзя просто так взять и распечатать её.</p><p>Если спецификация работает в паре с прототипом, важно не забыть сослаться на него во введении или на титульном листе.</p><p>Также на титульном листе можно разместить:</p><ul><li><p>Название проекта.</p></li><li><p>Информацию об авторах.</p></li><li><p>Версию документа и дату последней редакции.</p></li><li><p>Список предыдущих версий с кратким описанием изменений.</p></li></ul><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.3\" id=\"3.3\"></a><h3>Структура</h3><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/554/288/d78/554288d78f11ed1f63a40978b5abccf8.png\" alt=\"9. Конфигуратор одежды, структура спецификации\" title=\"9. Конфигуратор одежды, структура спецификации\" width=\"1580\" height=\"1560\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/554/288/d78/554288d78f11ed1f63a40978b5abccf8.png\"><figcaption>9. Конфигуратор одежды, структура спецификации</figcaption></figure><p>На картинке — структура самой базовой спецификации для конфигуратора одежды, разделённого на 6 этапов. В первом разделе описаны типовые элементы, которых совсем немного. В остальных разделах — этапы и отдельные шаги на этих этапах.</p><p>Сейчас я бы убрал описания шагов «Выбор подтипа изделия» и «Сообщение об оформленном заказе» в подразделы, чтобы разделы спецификации совпадали с видимыми в интерфейсе этапами конфигуратора. Объём информации позволяет так сделать.</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/9d0/c42/d9b/9d0c42d9b0f4247d70ff1afa18468236.png\" alt=\"10. Конфигуратор одежды, список этапов в интерфейсе\" title=\"10. Конфигуратор одежды, список этапов в интерфейсе\" width=\"1920\" height=\"206\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/9d0/c42/d9b/9d0c42d9b0f4247d70ff1afa18468236.png\"><figcaption>10. Конфигуратор одежды, список этапов в интерфейсе</figcaption></figure><p>Но я не стал переделывать пример: 1) артефакты редко бывают идеальными, 2) не хотел отступать от изначального содержимого доклада, на котором основывается эта статья, 3) нет какой-то единственно верной структуры спецификации.</p><p>Я придерживаюсь принципа: если появляются заголовки пятого уровня, возможно, продукт слишком большой и отдельные его части стоит описывать в отдельных документах. Либо спецификация пытается соответствовать структуре продукта. Даже если осуществимо (дерево может быть очень глубоким), это не даёт особых преимуществ при чтении спецификации.</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/66b/b8e/3d8/66bb8e3d8351c74bcad026d124fc64c5.png\" alt=\"11. Фрагмент структуры спецификации с описанием части сайта для неавторизованных пользователей\" title=\"11. Фрагмент структуры спецификации с описанием части сайта для неавторизованных пользователей\" width=\"1588\" height=\"540\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/66b/b8e/3d8/66bb8e3d8351c74bcad026d124fc64c5.png\"><figcaption>11. Фрагмент структуры спецификации с описанием части сайта для неавторизованных пользователей</figcaption></figure><p>Описание типовых элементов интерфейса, которые встречаются только в конкретном модуле (вроде части сайта для неавторизованного пользователя), можно разместить в разделе спецификации, посвящённом этому модулю, — как на картинке. Либо все типовые элементы, встречающиеся по всему продукту и в отдельных модулях, можно описать в одном разделе, посвящённом типовым элементам. Выбор зависит от структуры продукта, количества типовых элементов, их распределения по модулям продукта и личных предпочтений дизайнера (тоже немаловажный фактор).</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/b00/e84/834/b00e84834efb91a2f71ed93781d48f87.png\" alt=\"12. Конфигуратор одежды, описание шага выбора типа изделия\" title=\"12. Конфигуратор одежды, описание шага выбора типа изделия\" width=\"1580\" height=\"780\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/b00/e84/834/b00e84834efb91a2f71ed93781d48f87.png\"><figcaption>12. Конфигуратор одежды, описание шага выбора типа изделия</figcaption></figure><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c54/25e/ce2/c5425ece20d1bfa45d7bbb85badfd3b6.png\" alt=\"13. Конфигуратор одежды, описание типового элемента\" title=\"13. Конфигуратор одежды, описание типового элемента\" width=\"1580\" height=\"450\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/c54/25e/ce2/c5425ece20d1bfa45d7bbb85badfd3b6.png\"><figcaption>13. Конфигуратор одежды, описание типового элемента</figcaption></figure><p>Как я писал выше, можно сначала описать типовой элемент, а затем ссылаться на него при описании страниц, на которых он встречается. На конкретной странице часть его свойств можно переопределить или дополнить. Например, можно указать, что на странице с поисковой выдачей поле поиска будет по умолчанию заполнено, или добавить текст конкретной подсказки, никак не касаясь типовой логики её отображения.</p><p>Некоторые типовые элементы на странице можно даже не упоминать. Например, в описании списка шагов конфигуратора можно указать, что он есть на всех страницах конфигуратора, если не указано обратное.</p><p>Заголовки и все абзацы стоит нумеровать, чтобы можно было сослаться на подраздел (например, на описание компонента в §1.1) или обсудить конкретный тезис (информацию о типе изделия в §2, пункте 2.d).</p><blockquote><p>Дополнение Марины Пустовит: Вигерс приводит классный способ нумерации. Смысл в том, что цифры не очень информативны. В многоуровневом документе номер параграфа 4.6.2.1.7 не помогает читателю понять, где в документе он находится и о чём там речь. Вместо этого можно нумеровать словами, а также комбинировать слова и цифры, например: «Слово.Слово.Слово.1.2».</p></blockquote><p>Сам я так не делал, но раз Вигерс советует, а Марина практикует, идея стоит упоминания.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.4\" id=\"3.4\"></a><h3>Описание элементов</h3><p>Чтобы описать страницу (экран, блок на длинной странице), для начала можно выписать, какие элементы интерфейса на ней есть, и рассмотреть их по отдельности.</p><p>Полезные вопросы для описания любого элемента интерфейса:</p><ul><li><p>Когда не отображается?</p></li><li><p>Из чего состоит?</p></li><li><p>Какие составные части могут отсутствовать или быть неактивными и почему?</p></li><li><p>Как пользователь может с ним взаимодействовать. Что при этом происходит?</p></li><li><p>В каких состояниях элемент может находиться?</p></li><li><p>Как при наведении на него меняется курсор?</p></li></ul><p>Например:</p><p>В новостной ленте каждая новость состоит из заголовка, текста, даты-времени и картинки. Если редактор не нашёл подходящего изображения, будет отображаться картинка-заглушка или альтернативный дизайн новости (без картинки)?</p><p>Изменение стрелки на текстовый курсор ⌶ при наведении на текст подсказывает, что пользователь прямо сейчас может его отредактировать. Иногда ответить на вопрос о поведении курсора довольно непросто, например: «Надо ли превращать курсор в палец над кнопками на сайтах?».</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e66/51a/94c/e6651a94c382844ffc6b4929fe85f705.png\" alt=\"14. Конфигуратор одежды, галерея изображений\" title=\"14. Конфигуратор одежды, галерея изображений\" width=\"1900\" height=\"1240\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/e66/51a/94c/e6651a94c382844ffc6b4929fe85f705.png\"><figcaption>14. Конфигуратор одежды, галерея изображений</figcaption></figure><p>В галерее изображений можно переключать вертикальный список превью. К чему приведёт нажатие на нижнюю иконку шеврона: к отображению одного нового превью или блока из семи новых картинок? А если есть только три новых картинки, на экране будут они и пустое место или три новых и четыре старых картинки? Если новых картинок нет, шеврон станет неактивным, пропадёт или прокрутит список картинок в самое начало? Вот часть спецификации:</p><ol><li><p>Кнопки для прокрутки списка превью отображаются, если изображений в галерее больше N (количество определяется на этапе дизайна).</p></li><li><p>Нажатие приводит к прокрутке списка и отображению следующих N превью.</p></li><li><p>Если следующих превью меньше N, отображаются все новые превью и часть старых, из предыдущей группы.</p></li><li><p>Если следующих превью нет, кнопка не отображается.</p></li></ol><p>Полезные вопросы для описания элементов интерфейса определённого типа:</p><p>1. Список и таблица:</p><ul><li><p>Из чего состоит элемент списка?</p></li><li><p>Сколько элементов списка отображается на странице?</p></li><li><p>Когда отображается постраничная навигация?</p></li><li><p>Как упорядочен по умолчанию? Например: в прямом алфавитном порядке по названию, в обратном хронологическом по дате публикации.</p></li><li><p>Что будет, если в списке не окажется ни одного элемента?</p></li></ul><p>2. Кнопка:</p><ul><li><p>Когда может быть неактивной?</p></li><li><p>Что происходит при нажатии активной и неактивной кнопки?</p></li><li><p>Как ведёт себя, чтобы не допустить двойного нажатия и двойной отправки данных?</p></li><li><p>Какие вызывает сообщения об ошибках заполнения формы?</p></li></ul><p>Если кнопка неактивна, полезно сообщать пользователю, почему так и как её активировать. Например, при наведении на неё курсора.</p><p>3. Поле формы:</p><ul><li><p>Тип поля?</p></li><li><p>Обязательно ли для заполнения?</p></li><li><p>Есть ли требования к вводимым данным? Например, можно вводить только цифры.</p></li><li><p>Минимальные и максимальные значения?</p></li><li><p>Значение по умолчанию? Например: на странице с поисковой выдачей поле поиска по умолчанию заполнено пользовательским запросом; на странице регистрации флаг в чекбоксе «Подписаться на новости компании» по умолчанию установлен.</p></li><li><p>Наличие или отсутствие плейсхолдера?</p></li><li><p>Текст плейсхолдера, если он не показан в прототипе?</p></li><li><p>Текст сообщений об ошибках?</p></li><li><p>Когда сообщения об ошибках будут отображаться: во время заполнения формы или в момент её отправки? Если во время заполнения, то когда именно? Например, когда поле теряет фокус.</p></li><li><p>Связь с другими полями формы и элементами страницы? Например: если флаг в чекбоксе «Уведомлять по электронной почте» установлен, отображается поле для ввода адреса электронной почты.</p></li></ul><p>4. Поле поиска:</p><ul><li><p>Когда отображаются и как работают подсказки?</p></li><li><p>Появляется ли кнопка очистки поля?</p></li><li><p>Реагирует ли на нажатие клавиш? Например, нажатие на Enter приводит к отображению поисковой выдачи.</p></li></ul><p>5. Контент:</p><ul><li><p>Откуда появляется?</p></li><li><p>По каким принципам генерируется? Решение с обозначениями «К1» и «К2» в примере в начале статьи, возможно, не самое удачное, но оно записано и его можно обсуждать.</p></li><li><p>Как пользовательские данные влияют на поведение системы?</p></li></ul><p>Примеры влияния пользовательских данных:</p><p>В форме заказа пользователь выбирает регион. В одних регионах заказы обслуживает сама компания, в остальных — региональные партнёры. Специалисты компании работают в CRM, а партнёры получают заказы по электронной почте. Во втором случае потребуется шаблон электронного письма.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/34f/cc3/db0/34fcc3db020cf46472746e0c119793f4.png\" alt=\"15. Приложение сигнализации, сообщение о датчике, который сработал при включении сигнализации\" title=\"15. Приложение сигнализации, сообщение о датчике, который сработал при включении сигнализации\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/34f/cc3/db0/34fcc3db020cf46472746e0c119793f4.png\"><figcaption>15. Приложение сигнализации, сообщение о датчике, который сработал при включении сигнализации</figcaption></figure><p>Пользователь может включить сигнализацию, не закрыв окно в детской. Может быть, он просто забыл или специально оставил детскую проветриваться. В этом случае, если сигнализация включена, закрытие окна приведёт к отправке уведомления, а повторное его открытие — к тревоге.</p><p>Пользователь видит текст о датчике и логике работы сигнализации и может решить: закрыть окно или спокойно уйти, так как день не ветреный и окно само не захлопнется. Экран с этим сообщением появился уже при написании спецификации, когда я прикидывал, какими могут быть пользовательские данные (показания датчиков) при включении сигнализации.</p><p>И в заключение параграфа — пример элемента с нетиповым взаимодействием:</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/1d7/8a7/77b/1d78a777b740c809f476eceef38c6c6f.png\" alt=\"16. Конфигуратор одежды, редактирование нанесения в виде картинки\" title=\"16. Конфигуратор одежды, редактирование нанесения в виде картинки\" width=\"1430\" height=\"1230\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/1d7/8a7/77b/1d78a777b740c809f476eceef38c6c6f.png\"><figcaption>16. Конфигуратор одежды, редактирование нанесения в виде картинки</figcaption></figure><p>Пользователь добавляет на футболку нанесение в виде текста или изображения. У любого нанесения есть два состояния: просмотр и редактирование. Нанесения не могут пересекаться — это техническое ограничение процесса печати и вышивки на одежде. Чтобы отредактировать нанесение, надо на него нажать.</p><p>Описание взаимодействия, включающее реакцию на некоторые клавиши:</p><ol><li><p>Нажатие на нанесение приводит к его выделению и отображению его настроек.</p></li><li><p>Нажатие на второе нанесение, когда первое выделено, приводит к скрытию настроек первого и отображению настроек второго.</p></li><li><p>Нанесения не могут пересекаться.</p></li><li><p>Выделенное нанесение удаляется, если пользователь нажимает клавишу Delete или Backspace. Не работает в режиме редактирования текста в текстовом нанесении.</p></li></ol><p>В режиме редактирования нанесение можно перемещать, масштабировать и поворачивать. Возникают вопросы: с каким шагом в градусах его можно поворачивать; что если пользователь переместит его за пределы области нанесения?</p><ol><li><p>Пользователь поворачивает нанесение, удерживая его за специальный контрол, нанесение поворачивается в заданную пользователем сторону с шагом в 90 градусов.</p></li><li><p>Пользователь перемещает нанесение, удерживая его за специальный контрол.</p></li><li><p>Пользователь может переместить его за пределы области нанесения, но не далее рабочей области. При этом:</p><ol><li><p>Часть нанесения, оказавшаяся за пределами области нанесения, не отображается.</p></li><li><p>Контур нанесения и связанные с ним контролы настройки отображаются и за пределами области нанесения.</p></li></ol></li></ol><p>Состояние с объектом, оказавшимся за пределами области нанесения (с контуром и частично скрытым текстом или изображением), надо показать в прототипе.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.5\" id=\"3.5\"></a><h3>Описание страниц</h3><p>Поведение системы не всегда связано с конкретными элементами на странице. В этом случае можно описать поведение страницы в целом.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e5c/1d4/bc7/e5c1d4bc751c9e9ba3f6a6f78011ae06.png\" alt=\"17. Приложение сигнализации, пользовательское соглашение\" title=\"17. Приложение сигнализации, пользовательское соглашение\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/e5c/1d4/bc7/e5c1d4bc751c9e9ba3f6a6f78011ae06.png\"><figcaption>17. Приложение сигнализации, пользовательское соглашение</figcaption></figure><p>Экран с пользовательским соглашением появляется при первом запуске приложения и при каждом изменении соглашения. Вопрос: когда пользователь увидит его во второй раз, не решит ли он, что это сбой в матрице, ведь он уже соглашался с условиями? Возможно, стоит предусмотреть дополнительное состояние экрана на случай, когда соглашение изменится. Вот описание экрана «Пользовательское соглашение»:</p><ol><li><p>Экран отображается:</p><ol><li><p>При первом запуске приложения до тех пор, пока пользователь не подтвердит согласие с условиями пользовательского соглашения.</p></li><li><p>При открытии приложения в случае, если текст соглашения был изменён и требует нового согласия пользователя. В этом случае текст соглашения будет начинаться со слов о том, что соглашение было изменено.</p></li></ol></li></ol><p>В итоге решили обойтись без дополнительного состояния.</p><p>Что если пользователь открывает приложение из-за тревоги, а соглашение изменилось? В этот момент неуместно просить ознакомиться с новой версией документа, даже если он написан человеческим, а не юридическим языком. Это тоже стоит добавить в спецификацию.</p><p>Тревога и наличие нескольких объектов приводит к появлению межэкранной логики:</p><ol><li><p>Когда у пользователя более одного объекта, после входа он переходит:</p><ol><li><p>Если тревоги нет — на экран со включённой или выключенной сигнализацией последнего выбранного объекта.</p></li><li><p>Если тревога у одного объекта — на экран тревоги этого объекта.</p></li><li><p>Если тревога у двух и более объектов — в главное меню.</p></li></ol></li></ol><p>Эта логика может быть зафиксирована в описании кнопки «Войти», но лучше её вынести в документ со сценариями или юзерфлоу. Особенно, если войти в приложение можно с помощью других кнопок (например, через соцсети).</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"4\" id=\"4\"></a><h2>Примечания</h2><p>Это текстовая версия моего доклада о функциональной спецификации интерфейса с конференции БИФ, прошедшей четыре года назад. С тех пор материал не сильно устарел, но эта статья — не просто транскрипт. Я постарался сделать её понятнее доклада: переработал структуру, уточнил формулировки, убрал краткий рассказ об артефактах проектирования и лишние примеры, добавил важные уточнения. Есть <a href=\"https://www.youtube.com/watch?v=XaRymaGcPXM\" rel=\"noopener noreferrer nofollow\"><u>запись доклада</u></a> (41 минута), но статья лучше, и читать её всего 15 минут.</p><p>Спасибо Марине Пустовит, Даниилу Скрыльникову и Егору Камелеву за комментарии, которые помогли дополнить статью и упростить её для восприятия.</p><p>…</p><p>Подписывайтесь на мой телеграм-канал <a href=\"https://t.me/uxnotes\" rel=\"noopener noreferrer nofollow\"><u>UX Notes</u></a>!</p><p></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-15T14:32:33.446Z",
      "edit_date": "2022-06-16T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 4,
    "fields": {
      "category": 2,
      "author": 1,
      "title": "Использование RTK Query вместе с Redux Toolkit [На примере Next.js + TypeScript]",
      "image": "article_images\\16ea006f406442617a5c5041e01ede02.png",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><h2>Введение</h2><p>Всем привет :) Хотел бы рассказать об использовании RTK Query + Redux Toolkit в больших проектах, а также ускорить вашу разработку и добавление новых страничек путем избавления от ненужных дублирований кода.</p><p>Если ты frontend-разработчик на react, то думаю вам не впервой сталкиваться с использованием RTK Query вместе с Redux Toolkit. Но даже если это не так, то думаю мне есть что тебе показать новое ;) А если ты ни разу не сталкивался с этой связкой, то возможно после этой статьи задумаешься о её использовании.</p><h2>Предисловие</h2><p>Рекомендуется <a href=\"https://github.com/AleksanderZverev/redux-template\" rel=\"noopener noreferrer nofollow\">скачать проект</a> и по ходу чтения заглядывать в код, ибо некоторые моменты проще увидеть и понять, чем читать десятки слов и предложений.</p><p>Установка зависимостей: <code>yarn install</code>. Запуск по команде: <code>yarn dev</code>.</p><h2>Основные проблемы данной связки библиотек</h2><ul><li><p>Необходимо постоянно писать лоадеры, которые бы показывали загрузку страницы, а затем отрисовывали бы полученные данные.</p></li><li><p>Иногда хочется получить просто данные из запроса без создания отдельного слайса для страницы, а когда-то наоборот.</p></li><li><p>Всегда необходимо думать об обработке неожиданных ошибок при добавлении новых страничек в сервис и отрисовывать окошко ошибки. При это хочется избежать использования глобального обработчика.</p></li><li><p>Если необходимы 2 и более запроса, то приходится отдельно прописывать логику и объединять запросы. А если один из них провалится, прописывать логику повторного запроса.</p></li><li><p>При добавлении данных в слайс в методе onQueryStarted, данные просто не успевают попасть в хранилище до отрисовки компонента, который его использует.</p></li><li><p>При запросе какой-либо мутации может инвалидироваться тег, что вызовет перезагрузку всей страницы, даже когда в этом нет необходимости.</p></li></ul><p>Спешу вас обрадовать, я эти проблемы решил и причем с минимальным количеством кода, поэтому давайте же перейдем к решению и самому проекту.</p><h2>Структура проекта</h2><p>Всю основную логику помещаем в папку redux. Разделяем api-запросы и слайсы по отдельным папочкам. Для лучшего понимания представляйте api, как верхний слой над слайсами. Api работает, проводит какие-то свои манипуляции и кладет их в хранилище. Хранилищу необязательно знать, кто и что в него кладет, ему лишь надо знать, что надо с сделать с данными. <em>Api может обращаться к слайсам, но слайсы не могут обращаться к api.</em> </p><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c98/fd3/eee/c98fd3eeee1978c66b8116666907a64f.png\" alt=\"Папка Redux\r\n\" title=\"Папка Redux\r\n\" width=\"269\" height=\"177\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/c98/fd3/eee/c98fd3eeee1978c66b8116666907a64f.png\"><figcaption>Папка Redux\r\n</figcaption></figure><p>Полезные для использование хуки и <a href=\"https://ru.reactjs.org/docs/higher-order-components.html\" rel=\"noopener noreferrer nofollow\">компоненты высшего порядка</a> кладем в соответствующие папки hooks и hoc.</p><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/da2/365/5d5/da23655d5b295b508b8145734ee1a474.png\" alt=\"Папки hooks и hoc\" title=\"Папки hooks и hoc\" width=\"303\" height=\"138\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/da2/365/5d5/da23655d5b295b508b8145734ee1a474.png\"><figcaption>Папки hooks и hoc</figcaption></figure><p>Страницы в Next.js находятся в особенной папке <em>pages</em>. Все примеры использования в <code>cat-facts/index.tsx</code></p><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/b81/494/fbe/b81494fbe7e878f5ad7c89c00aa0ac82.png\" alt=\"Папка pages\" title=\"Папка pages\" width=\"297\" height=\"110\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/b81/494/fbe/b81494fbe7e878f5ad7c89c00aa0ac82.png\"><figcaption>Папка pages</figcaption></figure><h2>Проблема и решение</h2><blockquote><p>При добавлении данных в слайс в методе onQueryStarted, данные просто не успевают попасть в хранилище до отрисовки компонента, который его использует.</p></blockquote><p>Переопределяем <code>baseQuery</code> и принимаем через аргументы метод <code>onSuccess</code>, который позволит нам помещать данные в хранилище, а после этого завершать загрузку. Не забываем вызов обернуть в try catch, чтобы видеть ошибки в консоли.</p><details class=\"spoiler\"><summary>Код</summary><div class=\"spoiler__content\"><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/721/66a/136/72166a136669c44b671e0155e875b0b1.png\" width=\"901\" height=\"680\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/721/66a/136/72166a136669c44b671e0155e875b0b1.png\"><figcaption></figcaption></figure><p></p></div></details><details class=\"spoiler\"><summary>Пример использования слайсов и апи методов</summary><div class=\"spoiler__content\"><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/7e1/251/69e/7e125169e9ccee679879174ef80e2352.png\" alt=\"Слайс\" title=\"Слайс\" width=\"597\" height=\"538\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/7e1/251/69e/7e125169e9ccee679879174ef80e2352.png\"><figcaption>Слайс</figcaption></figure><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/560/a0a/c26/560a0ac26534a2e8217802938530be81.png\" alt=\"Api\" title=\"Api\" width=\"634\" height=\"485\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/560/a0a/c26/560a0ac26534a2e8217802938530be81.png\"><figcaption>Api</figcaption></figure><p></p></div></details><blockquote><p>Необходимо постоянно писать лоадеры, которые бы показывали загрузку страницы, а затем отрисовывали бы полученные данные.</p></blockquote><p>Создаем специальный «хок», который будет делать запросы и выводить сообщения в случае ошибки. Логика его достаточна сложна, поэтому обратитесь к коду проекта. Находится в одноименной папке <code>src/hoc</code>. Можете адаптировать его под свою архитектуру проекта.</p><details class=\"spoiler\"><summary>Для тех кто разбирается в TS</summary><div class=\"spoiler__content\"><p>Типизация при использовании работает отлично, однако от костыля при преобразовании к any, я так и не смог избавиться. Если кто-то знает, как решить, прошу Merge Request в репозиторий кинуть.</p><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/399/053/970/39905397014f92e97c886b04ed0bcad9.png\" alt=\"Костыль\" title=\"Костыль\" width=\"330\" height=\"57\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/399/053/970/39905397014f92e97c886b04ed0bcad9.png\"><figcaption>Костыль</figcaption></figure><p></p></div></details><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/b5e/b40/497/b5eb4049736c3591908ba57a6ea8760e.png\" alt=\"Папка hoc\" title=\"Папка hoc\" width=\"292\" height=\"47\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/b5e/b40/497/b5eb4049736c3591908ba57a6ea8760e.png\"><figcaption>Папка hoc</figcaption></figure><blockquote><p>Если необходимы 2 и более запроса, то приходится отдельно прописывать логику и объединять запросы. А если один из них провалится, прописывать логику повторного запроса.</p></blockquote><p>Прежде чем использовать метод, создаем страничку, которая будет отрисовывать данные. Чтобы использовать данные от запросов, объединяем типы наших резолверов и наследуемся от них.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/1f8/40e/2a1/1f840e2a1abdb24213dbb8ea9e9e96e0.png\" alt=\"Страница отрисовки данных\" title=\"Страница отрисовки данных\" width=\"760\" height=\"327\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/1f8/40e/2a1/1f840e2a1abdb24213dbb8ea9e9e96e0.png\"><figcaption>Страница отрисовки данных</figcaption></figure><p>Далее используем «хоки» для обработки запросов к api:</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/2fb/d80/48a/2fbd8048acd447f1135eba80a93b2d59.png\" alt=\"Использовать «хоков»\" title=\"Использовать «хоков»\" width=\"901\" height=\"100\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/2fb/d80/48a/2fbd8048acd447f1135eba80a93b2d59.png\"><figcaption>Использовать «хоков»</figcaption></figure><p><strong>withQueryResolver</strong> – содержит в себе самый главный запрос, который потом можно принять через аргументы и использовать данные. Вызывать можно только 1 раз и перед withOtherQueryResolver</p><p><strong>withOtherQueryResolver</strong> – содержит в себе второстепенный запрос, которые нельзя принять через аргументы. Обычно используется, чтобы какие-то дополнительные данные положить в хранилище (слайсы). Должен идти после <strong>withQueryResolver</strong>. Могут быть вызваны друг за другом несколько раз. При ошибке перезагрузка данных будет только у тех, что завершились ошибкой, а не у всех сразу.</p><p><strong>withMutationResolver</strong> – отвечает за обработку мутации, показа модалки загруузки, вывод модалки с ошибкой (если нужно). Можно адаптировать под свой проект.</p><p>Как мы видим процесс загрузки и объединения запросов занимает всего 2 строчки, а подключение логики с обработкой мутации всего 1 строчку.</p><p>И наконец прописываем страницу, которая будет экспортироваться во внешку:</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/16e/a00/6f4/16ea006f406442617a5c5041e01ede02.png\" width=\"591\" height=\"270\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/16e/a00/6f4/16ea006f406442617a5c5041e01ede02.png\"><figcaption></figcaption></figure><p>Все аргументы объединяются для каждого хука, поэтому можно избежать дублирования.</p><blockquote><p>При запросе какой-либо мутации может инвалидироваться тег, что вызовет перезагрузку всей страницы, даже когда в этом нет необходимости.</p></blockquote><p>Так как мы данные получаем из слайсов, то нам не нужно делать запрос заново, поэтому вызываем метод <strong>disableReload</strong> перед запросом мутации. В таком случаем при успешном вызове наш тег инвалидируется, но это не спровоцирует перезагрузку страницы.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/606/835/6d3/6068356d31f3e773a536795b47e20421.png\" width=\"676\" height=\"230\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/606/835/6d3/6068356d31f3e773a536795b47e20421.png\"><figcaption></figcaption></figure><p>Метод <strong>showRetryModal</strong> используем, если хотим при ошибке показать модалку, что запрос не прошел и предложить повторить запрос.</p><h2>Итог</h2><p>При таком подходе удается создать в проекте устойчивую к росту архитектуру и облегчить разработку. Давайте посмотрим, чего мы добились:</p><ul><li><p>При добавлении новой страницы нам необходимо написать всего 2-3 строчки и логика обработки запроса уже готова. Далее остается только написать контрол, который уже будет работать с этими данными. Теперь можно не бояться, что при какой-то неожиданной ошибке у нас вместо красивого сообщения об ошибке будет белый экран или еще чего страшнее.</p></li><li><p>В случаем изменении какого-то api метода, «хоки» начнут ругаться, что им передали контроллер, который принимает совсем другие данные, нежели те, что api-хук. А значит вероятность выпустить релиз с багами уменьшается в разы, ведь в production такое не скомпилируется.</p></li><li><p>Благодаря объединению аргументов их можно использовать, как в компоненте приемнике, так и в других методах api. Например, миграция одного аргумента метода к другому методу это дело 3 секунд. Добавление какого-то нового аргумента тоже менее болезненна, ведь если он передается для какого-то другого api метода, правки не нужны и <em>typescript</em> не будет ругаться.</p></li><li><p>Если нам достаточно данных из хука, мы можем не создавать отдельный слайс под данные и соответственно не писать лишнего кода. Например, если наша страница всего лишь отображает данные, зачем писать для этого отдельный слайс? Можно просто взять готовые данные и отобразить.</p></li><li><p>Вся логика обработки ошибок находится в одном едином месте. В будущем при необходимости мы можем легко добавить сбор какой-то статистики или еще что-то.</p></li></ul><p></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-14T14:32:33.446Z",
      "edit_date": "2022-06-15T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 5,
    "fields": {
      "category": 2,
      "author": 2,
      "title": "ChainOps или DevOps",
      "image": "article_images\\1e14308161a4958b20c8c1bff56e64c7.png",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><p>В настоящее время все в пространстве DevOps связано со словом, оканчивающимся на ops: GitOps, AIOps, MLOps, DevSecOps, EverythingOps.&nbsp;Хотя, возможно, это уже упоминалось в другом месте, я хочу написать некоторые точки зрения о том, как применять процессы DevOps к блокчейнам и/или технологиям распределенного реестра (&nbsp;<em>DLT</em>&nbsp;).</p><p>Например, просто для описания одного из этих так называемых терминов «эксплуатация»: «GitOps — это операционная среда, которая использует лучшие практики DevOps, используемые для разработки приложений, такие как контроль версий, совместная работа, соответствие требованиям и CI/CD, и применяет их к автоматизации инфраструктуры.&nbsp;Сразу приходят на ум инструменты инфраструктуры как кода, такие как Terraform.</p><p>ChainOps (с моей точки зрения) следует использовать для описания методов DevOps, выполняемых прямо в пространстве блокчейна.</p><p>В децентрализованном мире основным участником разработки приложений или&nbsp;<em>Dapps</em>&nbsp;(децентрализованных приложений) является&nbsp;<strong>узел</strong>&nbsp;,&nbsp;<strong>узел</strong>&nbsp;в&nbsp;<em>DLT</em>&nbsp;(технология распределенного реестра) — это минимальный компонент инфраструктуры, способный запускать необходимое программное обеспечение, чтобы быть функциональной частью. бухгалтерской книги.</p><p>Таким образом, Devops должен отвечать за то, чтобы каждый узел имел одинаковые сетевые и инфраструктурные возможности (например, ОЗУ, ЦП, пропускную способность), а также одинаковые версии пакетов программного обеспечения.&nbsp;(Например, версии биткойн-ядра или версии DappNode)</p><p>Автоматизированные рабочие процессы DevOps должны отвечать за доставку и интеграцию не только версий основного узла, но и другого программного обеспечения, необходимого для&nbsp;<em>Dapp</em>&nbsp;.</p><p>Наконец, DevOps должен позаботиться о мониторинге, оповещении и, по сути, об измерении ключевых показателей производительности на каждом узле, чтобы применять настройки на основе всех данных, полученных агентами мониторинга.</p><p><br>С точки зрения инфраструктуры блокчейн — это цепочка узлов, которые имеют одно и то же программное обеспечение для вычислений и соединения с другими узлами, с точки зрения devops децентрализованная архитектура предлагает определенные преимущества, поскольку каждый узел или экземпляр точно такие же, как и другие. Хотя масштабируемость и высокая доступность не полностью достижимы, отчасти из-за синхронизации БД (каждый узел должен иметь одни и те же данные) среди других причин.<br><br>Вероятно, лучший способ начать рабочий процесс Devops для блокчейна (или DLT) — это использовать Terraform, код terraform должен отвечать за определение базовой сети и экземпляров, на которых должно работать программное обеспечение узла. Также Terraform дает возможность легко взаимодействовать с различными облаками без необходимости писать</p><p>Рабочий процесс GitOps должен быть настроен в Github/Gitlab/Bitbucket и т. д., чтобы разрешить реализацию CI/CD для кода или модулей Terraform.</p><p>Terraform также можно использовать для развертывания настраиваемых экземпляров с помощью, например, Packer, но это сильно влияет на время, необходимое для предоставления функций для блокчейна и/или узлов. Лично я предпочитаю, чтобы Terraform брал на себя определение общей инфраструктуры, а затем написать Ansible playbook для одновременного развертывания настроенного программного обеспечения на многих узлах, таким образом разделив развертывание инфраструктуры и сети и развертывание программного обеспечения.</p><p>Единственная часть, связанная с программным обеспечением, которую должна выполнить terraform, — это «упаковка» настроенного ami (или базового образа) с минимальным программным обеспечением, необходимым (если таковое имеется) для развертывания программного обеспечения узла.</p><p>В заключение, ChainOps — это сводка лучших практик и инструментов, которые позволяют реализовать автоматизацию инфраструктуры и конвейеры CI/CD, необходимые для развертывания&nbsp;<em>Dapps</em>&nbsp;и&nbsp;<strong>узлов</strong>&nbsp;подготовки на&nbsp;<em>DLT.</em><br><br></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-13T14:32:33.446Z",
      "edit_date": "2022-06-14T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 6,
    "fields": {
      "category": 3,
      "author": 2,
      "title": "Интересности для жанра ARPG | Часть 2",
      "image": "article_images\\63083b0c5bf611fc94792e1566923ef8.jpg",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><p>Ещё одна подборка некоторых механик для применения в играх типа Diablo.</p><p><a href=\"https://habr.com/ru/post/465003/\" rel=\"noopener noreferrer nofollow\">Первая часть</a></p><h2>Концентрированное здоровье</h2><p>В диаблоидах мне изначально импонирует именно система расходуемых зелий. Не бесконечное зелье, не постоянный встроенный реген здоровья, не лечилки по кулдауну. Поэтому, ориентируясь на реализацию зелий в Diablo 1 и Diablo 2, хотелось бы иметь больше одного вида бутылки здоровья, но и не слишком много. А также немного разнообразить эти самые бутылки, чтобы не было так, что зелье А однозначно хуже зелья Б, а оно в свою очередь всегда хуже зелья В. Вернее сделать все виды бутылок более менее востребованными на любом этапе игры. Эти соображения привели к такой концепции:</p><p>Шкала здоровья получает дополнительный параметр - концентрация. Чем выше концентрация, тем насыщеннее цвет шкалы. Концентрация падает с течением времени. От текущей степени насыщенности шкалы здоровья зависит то, как она реагирует на выпитое зелье. Если насыщенность слабая, то здоровье восполняется с некоторой задержкой. Если насыщенность средняя, то здоровье восстановится мгновенно. Если насыщенность близка к предельным значениям, то выпитое зелье дополнительно вызывает эффект регенерации (фиксированное время или пока насыщенность не упадёт до средних значений).</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/60b/1c0/0b5/60b1c00b5c2d93015bcc7d09c24c39cc.jpg\" alt=\"Здоровье низкой концентрации, средней и высокой\" title=\"Здоровье низкой концентрации, средней и высокой\" width=\"654\" height=\"229\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/60b/1c0/0b5/60b1c00b5c2d93015bcc7d09c24c39cc.jpg\"><figcaption>Здоровье низкой концентрации, средней и высокой</figcaption></figure><p>Тогда сами зелья, допустим, их будет 3 вида - могут выглядеть следующим образом: простое зелье (не влияющее на концентрацию), среднее (незначительно повышает концентрацию) и сильноконцентрированное (значительно повышающее концентрацию). Таким образом сильноконцентрированные зелья не настолько необходимы, когда концентрации и так хватает - в такие моменты простые зелья становятся актуальнее. Для ещё более сильного сглаживания между степенью полезности различных зелий можно сделать так, что зелья попроще и здоровья прибавляют больше. Например, условно, простое зелье восполнит 50% шкалы, среднее 45%, а сильной концентрации - 40%.</p><figure class=\"\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/cdb/0e3/177/cdb0e3177edf9d779f81d22dbd04bb21.jpg\" alt=\"Зелье без влияния на концентрацию, слабого влияния и сильного влияния\" title=\"Зелье без влияния на концентрацию, слабого влияния и сильного влияния\" width=\"507\" height=\"216\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/cdb/0e3/177/cdb0e3177edf9d779f81d22dbd04bb21.jpg\"><figcaption>Зелье без влияния на концентрацию, слабого влияния и сильного влияния</figcaption></figure><p>По аналогичному принципу могут работать и бутылки/шкала маны. </p><p>Для монстров и всяческих ловушек насыщенность шкалы тоже может являться одним из параметров, на которые они могут воздействовать. То есть какие-то монстры наносят повреждения, которые не влияют на концентрацию, а какие-то снижают её тоже. Определённые эффекты ловушек и вражеских заклинаний могут \"отравить\" концентрацию персонажа, тогда она будет падать намного быстрее. Либо временно \"заморозить\", мгновенно понизить её, \"проклясть\" героя (тогда любые зелья не дают концентрации, пока \"проклятие\" действует).</p><h2>Ресурсы вместо золота</h2><p>Здесь по сути имеется в виду разбиение единого универсального ресурса/валюты на отдельные, примерно равноправные виды (когда из этого планируется получить что-то новое для геймплея). То есть это может быть и вариант, с, допустим, делением единого золота на чёрное золото и белое золото. Или отсутствие золота как такового, но наличие каких-нибудь выполняющих его функцию цветных кристаллов - жёлтый, синий, зелёный и так далее.</p><p>Отсюда естественным образом вытекает, например, возможность крафта предметов: \"для создания предмета N нужны ресурсы A,B и E\". Если бы ресурс был единственный, золото, тогда подобный крафт смотрелся бы как покупка предмета у торговца.</p><p>Когда есть несколько ресурсов, то они вносят долю разнообразия в падающий с монстров лут. К тому же их можно закрепить за разными монстрами и прочими источниками сокровищ, чтобы добавить глубины игровому процессу - когда игроку нужен тот или иной вид ресурса, то он фокусируется на тех монстрах и источниках, которые его дают.</p><h2>Опыт не для персонажа</h2><p>Ввести в игру уровни персонажа - это универсальный хак, который всегда работает, легчайшим образом приносит чувство прогрессии и поддерживает интерес пользователя. Проблемы начинаются когда получение уровней затягивается, перестаёт на что-либо влиять или вовсе остановилось. Опять же в комплекте с подобной уровневостью практически всегда идёт линейность прохождения контента (а вот для того же жанра метроидваний, с нелинейным исследованием уровня и возвращениями в уже посещённые локации, уровневость персонажа как раз не обязательна, часто замещена какими-то находимыми усилениями, увеличением здоровья и собственно, новыми способностями), когда возврат в низкоуровневые места не имеет смысла.</p><p>Возможно, стоит вовсе убрать из игры уровни персонажа, сделать их незначительно влияющими на его параметры, сократить количество уровней или сделать систему \"перезагрузки\", которая так или иначе будет сбрасывать прогресс героя.</p><p>Также можно оставить некий получаемый опыт, но направить его не в получение уровней персонажа, а во что-то другое. Например раскачивать не героя, а его предметы и оружие, допустим, улучшая их в определённую сторону, затачивая в определённую стихию, увеличивая шансы попадания или просто приближая момент полного \"опознания\" предмета (когда выяснение свойств предмета происходит не от применения свитка, а именно раскрывается в процессе ношения предмета).</p><p>Предметами и оружием проще манипулировать, чем зашитыми в персонажа уровнями, параметрами и способностями. Они могут ломаться со временем, требовать подзарядки, не работать в определённым местах и ситуациях, против конкретных врагов. Одним словом - эти вещи относительно легко могут быть персонажем потеряны либо заменены, в то время как сбросить возможности зашитые в самого героя - более проблематично.</p><p>Получаемый опыт может быть направлен в ещё что-либо специфическое. Например, в получение неких ключей при каждом заполнении полоски, которыми в свою очередь можно открывать какие-то специальные сундуки, разбросанные по локациям. Одним словом, если нужны какие-то вещи, для которых запланирован постепенный гарантированный приход к игроку (в отличие от рандомного дропа с противников, который может долго не приносить нужных вещей или внезапно давать их слишком много), то можно привязать их получение к моментам накопления полоски опыта.</p><p>В роли специальных сундуков могут выступать и уже какие-то вскрытые игроком объекты, которые при первом осмотре дают какой-то дроп, раскрываясь не полностью, а по настоящему откроются уже при наличии у персонажа неизрасходованного ключа.</p><h2>Переселение душ</h2><p>Развитие предыдущего пункта, один из вариантов \"перезагрузки\" прогресса персонажа. Что если в качестве основного героя у нас будет некая душа, проживающая скоротечные жизни разных героев, теряющая при их смерти почти всё, но что-то и сохраняющая (хотя бы прогресс в исследовании локаций).</p><p>Персонаж, кстати, может тут вполне иметь стандартную уровневую прокачку, в то время как у самой души не будет уровней. Когда текущий персонаж умирает, то можно забыть про его уровни и про его лут - придётся искать другого. Возможно, сразу переселиться в какого-то заранее заготовленного или стандартного низкоуровневого. Возможно, побродить по окрестностям и вселиться в какое-то доступное тело поблизости.</p><p>При этом могут возникать дополнительные вопросы - насколько сильно стоит развивать эту сторону игры. Может быть дать душе выходить из тела в любой момент, подыскивая новые тела, и строить геймплей на этом. В таком случае, вероятно, посреди исследуемой местности могут быть некоторые преграды, через которые может пройти только душа, чтобы продвинуться дальше. То есть задача подконтрольного героя может заключаться в том, чтобы донести душу до очередной такой преграды, которую она сможет пересечь и найти себе нового носителя.</p><h2>ID-способности</h2><p>Систему заклинаний можно построить на том, чтобы герой находил особые камни, которые может складывать в различные комбинации, получая, например, активируемое заклинание из пары определённых установленных камней.</p><p>Это может быть реализовано через систему идентификаторов, которую я пару раз <a href=\"https://habr.com/ru/post/658443/\" rel=\"noopener noreferrer nofollow\">описывал ранее</a>. У каждого камня есть свой идентификатор, когда они участвуют в комбинации, то идентификаторы перемножаются и получаем, как минимум, 9 возможных исходов (по первой цифре результата - от 1 до 9). То есть, если герою доступно одно активируемое заклинание, которое получается от комбинации двух камней, то различные сочетания камней дадут 9 вариантов заклинаний - для простого диаблоида не так уж мало. Если у героя два доступных слота заклинаний (например, одно для левой кнопки мыши, другое для правой), то второе заклинание может иметь свои отдельные 9 вариантов и в сумме получится уже 18 заклинаний для героя (но в каждый момент времени он пользуется только двумя и из разных списков).</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/952/553/cc1/952553cc194b2090189084b0c7ea1ef6.jpg\" alt=\"Разные пары камней дают разные заклинания\" title=\"Разные пары камней дают разные заклинания\" width=\"655\" height=\"570\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/952/553/cc1/952553cc194b2090189084b0c7ea1ef6.jpg\" data-blurred=\"true\"><figcaption>Разные пары камней дают разные заклинания</figcaption></figure><p>Конечно, эту концепцию можно масштабировать в космические дали, если, например, брать первые две цифры от результата сочетания пары камней. Тогда камней с различными идентификаторами желательно добавить побольше, а вместо 9 исходов получится до 89 (числа от 10 до 99) возможных = 89 разных заклинаний. Но можно ограничиться более простым вариантом - до 9 вариантов заклинаний для каждого слота активного заклинания.</p><p>Пассивные способности могут регулироваться теми же камнями и слоты под них тоже могут иметь свои уникальные списки. То есть, допустим, может быть всего 9 доступных пассивных способностей, из которых выбираешь две. Или всего 18, но выбираешь первую пассивную способность из первых 9, и вторую из других 9.</p><p>Кроме определения вида заклинания, числа результатов комбинаций камней могут определённым образом влиять на что-то ещё. Например, на форму этого самого заклинания. То есть, имеем результат комбинации 2397, первое число устанавливает заклинание (например, 2 - это огонь), а второе число говорит о форме (например, 1,2,3 - это летящий шар, 4,5 - дыхание в конусе, 7,8 - фрагмент стены, 9,0 - расходящаяся волна).</p><p>Враги сами могут иметь идентификаторы и рассчитывать последствия взаимодействия с идентификатором каждого заклинания. К тому же их реакция может быть установлена случайной для каждой новой игры, тогда игроку понадобится выяснять, к чему уязвимы те или иные монстры в каждой конкретной игре.</p><p>Эффект воздействия на монстров может быть и общим для них всех, при этом случайным для новой игры, то есть когда в скелета прилетает файерболл, то их идентификаторы умножаются и получается результат, например, 723392. А в текущем глобальном эффекте воздействия первое число 7 означает, например, эффект замедления монстра. Тогда, все такие же файерболлы в этой текущей игре будут всегда замедлять движение скелетов. Если игрок найдёт другие заклинания и монстров, которые тоже при взаимодействии будут выдавать результат начинающийся на 7 - те монстры тоже будут замедляться от таких заклинаний.</p><p>В следующей игре, например, первая 7 в результатах взаимодействия заклинаний и монстров будет означать ваншот - мгновенное уничтожение рядового монстра. В то время как первая 2 - уже знакомое замедление, 4 - минимальные повреждения, 5 - эффект отбрасывания, 6 - кровотечение и так далее.</p><p>Воздействие эффектов на монстров может быть более тонким. Допустим, монстр запоминает первые две-три цифры каждого взаимодействия с заклинанием и \"хранит в памяти\" до 7 таких цифр. Тогда можно привязать какие-то эффекты к особенностям этой последовательности. Например, 3-ка \"злит\" монстра, если в этой последовательности накопится три цифры 3 (можно не подряд, а вобще), то монстр впадает в состояние берсерка. 5-ка, допустим, охлаждает конкретного монстра (пусть это будет некий стихийный элементаль, допустим, водяной) - две 5-ки в последовательности замедляют его, а три - замораживают. В то время как 8-ка того же монстра недраматически разогревает, то есть попавшие в последовательность 8-ки просто нивелируют охлаждающий эффект 5-ки. Или же разогревание тоже может быть драматическим, тогда две 8-ки разгонят элементаля, 3 сделают его кипящим, а 4 испарят. При этом каждая 5-ка тоже нейтрализует одну 8-ку. Ещё один монстр имеет волшебный щит. Допустим, три 7-ки отключают щит, после чего он открывается для эффекта двух 9-к, которые сразу убивают его. Таким образом можно развить эту систему, чтобы и сочетания заклинаний, последовательность их применения, играли роль - вроде того, что первым можно ослабить монстра и добить вторым.</p><h2>\"Органический\" инвентарь</h2><p>В различных диаблоидах и смежных с ними играх обычно фигурирует пара вариантов инвентаря - более \"классический\", когда предметы занимают разное количество клеток, и \"упрощённый\", где каждый предмет занимает одну ячейку.</p><p>Так вот, придумывая, как мог бы выглядеть инвентарь (трюм) у биомашинки, я вышел на концепцию некоей внутренней \"органической\" ёмкости, куда нужно компактно укладывать предметы, в то время как стенки этого контейнера прогибаются и деформируются, как бы обволакивая предметы. А когда предмет вынимается - некоторое время стенки контейнера сохраняют его форму.</p><p>Суть в следующем - у каждого предмета имеется некая зона влияния на окружающие ячейки инвентаря. От нулевой (тогда предмет занимает 1 ячейку), до 8 клеток (тогда предмет стремится занять все 8 примыкающих ячеек). Когда предмет перекладывается, то помещается в свободную ячейку (не занятую предметом или влиянием предмета), а на примыкающие ячейки распространяется зона его влияния - они становятся не пустыми и в них уже нельзя помещать предметы. Если предмет вынуть, его влияние с этих ячеек пропадает. Что всё это значит? По сути ничего нового - для того чтобы в инвентарь вошло больше предметов нужно перекладывать те, что уже там находятся, стараясь расположить зоны влияния предметов более экономным образом. Отличие в том, что такая перекладка выглядит менее квадратно-гнездовой и очевидной, более свободной, создающей впечатление именно засовывания вещей в рюкзак или мешок, таким образом, чтобы они расположились более компактно.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/51f/47c/e40/51f47ce403431269db1f5846f28feb60.jpg\" alt=\"Предмет слева имеет влияние на 3 клетки рядом с собой (выше, выше и правее и правую). Поместим два таких предмета в инвентарь размером 4 на 4 клетки. Тот, что в центре - занял 4 клетки, свою и те, что заблокированы теперь его влиянием. Предмет вверху занял всего одну клетку, так как его влияние не затронуло прочие ячейки. Если расположить центральный предмет левее или ниже того, что в углу, то его влияние тоже частично уйдёт за пределы инвентаря, частично &quot;наложится&quot; на занятую другим предметом клетку. \" title=\"Предмет слева имеет влияние на 3 клетки рядом с собой (выше, выше и правее и правую). Поместим два таких предмета в инвентарь размером 4 на 4 клетки. Тот, что в центре - занял 4 клетки, свою и те, что заблокированы теперь его влиянием. Предмет вверху занял всего одну клетку, так как его влияние не затронуло прочие ячейки. Если расположить центральный предмет левее или ниже того, что в углу, то его влияние тоже частично уйдёт за пределы инвентаря, частично &quot;наложится&quot; на занятую другим предметом клетку. \" width=\"580\" height=\"339\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/51f/47c/e40/51f47ce403431269db1f5846f28feb60.jpg\" data-blurred=\"true\"><figcaption>Предмет слева имеет влияние на 3 клетки рядом с собой (выше, выше и правее и правую). Поместим два таких предмета в инвентарь размером 4 на 4 клетки. Тот, что в центре - занял 4 клетки, свою и те, что заблокированы теперь его влиянием. Предмет вверху занял всего одну клетку, так как его влияние не затронуло прочие ячейки. Если расположить центральный предмет левее или ниже того, что в углу, то его влияние тоже частично уйдёт за пределы инвентаря, частично \"наложится\" на занятую другим предметом клетку. </figcaption></figure><p>К этой концепции можно прийти просто программируя инвентарь \"классического\" диаблоида - там на самом деле работает схожий принцип, просто правила немного другие. Перемещаемый предмет обладает такой же зоной влияния, но распространяющейся не вокруг, а вправо в вниз от корневой ячейки. Кроме этого там предмет не может быть перемещён, если в эту зону влияния хотя бы что-то попадает - она вся должна быть не занята. В \"органическом\" инвентаре, напротив, неважно, что окажется в зоне влияния - предмет может быть установлен в любую свободную ячейку, не занятую предметами или влиянием других предметов.</p><h2>Примеры реализации</h2><p>Пользуясь фреймворком PlayCanvas я задумал собрать прототип простенького диаблоида, в том числе использовав там некоторые задумки из первой части механик для ARPG.</p><p>Замечу, что условным эталонным диаблоидом лично для меня является всё-таки первая Diablo, притом консольная версия, где двигаться нужно было стрелочками, а не мышкой. Поэтому диаблоиды на ПК мне обычно не слишком нравятся (включая D1 и D2) уже хотя бы по причине просто сумасшедшей нагрузки на мышь (вернее на кисть правой руки, бог с ней  с мышью), с этими микроприцеливаниями во всё подряд. Руки должны быть равномерно загружены, а мышь должна знать своё место. Допустим, в League of Legends (путь это и не диаблоид) мышь используется довольно интенсивно, но сверхточные клики мышью не требуются, а нагрузка более менее распределена по обоим рукам, в то время как от управления Path of Exile и прочих \"классических\" представителей arpg жанра устаёшь довольно быстро. </p><p>Конечно, у первой Diablo много своих недостатков, например, на той же консоли было сложно заходить в инвентарь, устанавливать заклинания, сохраняться/загружаться, покупка товаров через список довольно неудобна, ещё какие-то мелочи. Но уже ко 2-й части многое хорошее куда-то выветрилось и более не возвращалось в серию. Например, сама концепция исследования подземелий/этажей, что мне очень нравится, в отличие от беготни по всяким полупустым полям/степям с заходами в неглубокие (как новосибирское метро) мини-подземельями. Магические книжки находить интереснее, чем тыкать фиксированные навыки в дереве прокачки. Нет такого огромного перегруза лишними вещами/параметрами/союзниками, как в D2. Одним словом, при всех несовершенствах интерфейса, сама базовая формула первой Diablo мне как-то больше импонирует и если на что и хотелось ориентироваться, то куда-то в ту сторону.</p><p>Итак, проект <strong>Chaosborn</strong>. Сюжет (если это можно назвать сюжетом) в том, что герой просыпается/воскресает в некоем подземелье, выбираясь из саркофага. И начинает свой путь по подземелью, постепенно выбираясь на этажи повыше.</p><div class=\"embed_link\"><div class=\"embed__thumb\" style=\"background-image: url(&quot;https://img.itch.zone/aW1nLzc0MjM3MTIuanBn/original/SwhJX1.jpg&quot;);\"></div><div class=\"embed__caption\"><div class=\"embed__caption-title\"><span>Chaosborn</span></div><a href=\"https://thenonsense.itch.io/chaosborn\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"embed__caption-link\">thenonsense.itch.io</a></div></div><iframe frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" src=\"https://embedd.srv.habr.com/iframe/62ac77f5de22274fb4bad9d7\" style=\"\" width=\"\" id=\"62ac77f5de22274fb4bad9d7\" height=\"398\"></iframe><p>Здесь я ориентировался на упоминавшуюся в <a href=\"https://habr.com/ru/post/465003/\" rel=\"noopener noreferrer nofollow\">первой части arpg-интересностей</a> концепцию внеземной пирамиды, по этажам которой герой продвигается не вниз, а вверх. Также герой не привязан к некоей базе, типичной для диаблоидов - некуда вернуться и продать/купить предметы. Тем не менее, он может разбирать находимые им вещи на фрагменты. Чтобы позднее из фрагментов собирать какие-то полезности, например, те же зелья маны/жизни. Для сборки нужны свитки с рецептами. Вернее я сделал таким образом, что все рецепты доступны сразу (хотя в демо их доступно мало), в отдельном меню, но поначалу закблокированы, а открывать их можно за такую валюту как универсальные свитки (редкий дроп с монстров и прочих источников лута).</p><p>Концепция с душами здесь тоже присутствует и выглядит следующим образом: путешествуя по подземелью герой иногда находит прочие саркофаги, в которых кто-то лежит (помимо тех, из которых просто выпадает лут). Если герой умирает, то игрок переносится в одного из ранее найденных героев, которые воскресают в своих саркофагах. У них свой пустой инвентарь, но накопленные фрагменты, свитки и разблокированные рецепты переносятся, плюс начисляется некоторое количество бонусных фрагментов.</p><p>Используются зелья маны и здоровья, по одному виду бутылок для каждого ресурса. Применяются нажатием на символизирующие их кнопки - расходуется первая попавшаяся бутылка такого типа в инвентаре.</p><p>Предметы экипировки сделаны простыми, без дополнительных свойств, с фиксированными бонусами. Это несколько разновидностей предметов для слота маски, для слота артефакта и в слот кольца.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/42c/b45/e5c/42cb45e5c7cc88e40824bfaeb1a4c9da.jpg\" alt=\"Открытый инвентарь и слоты экипировки.\" title=\"Открытый инвентарь и слоты экипировки.\" width=\"956\" height=\"664\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/42c/b45/e5c/42cb45e5c7cc88e40824bfaeb1a4c9da.jpg\" data-blurred=\"true\"><figcaption>Открытый инвентарь и слоты экипировки.</figcaption></figure><p>Что касается оружия - с ним всё сложнее. Герой у нас в целом чисто маг (да, вот так вот ультимативно - ну нравится мне играть в диаблоиды исключительно магами и прочими подходящими на их роль) и может стрелять простеньким слабым заклинанием без всяких проблем и без траты маны, правда оно очень медленно и недалеко летит. Если экипировать специальное хаотическое оружие, то выстрелы становятся более мощными, но расходуют ману. При этом выстрелы каждого конкретного хаотического оружия видоизменяются, в зависимости от скрытых внутри него комбинаций - наносят урон разными \"стихиями\", ускоряются, замедляются, становятся двойными, расходуют больше/меньше маны, замедляют или поджигают врагов.</p><p>При уничтожении врагов из них вылетают недолговечные искры, если поймать такую искру, то она втянется текущим экипированным хаотическим оружием, заняв одну из 9 его ячеек. Каждая вертикальная колонка из ячеек отвечает за какое-то свойство (модификатор) выстрела. Всего у выстрела 3 модификатора, они поочерёдно открываются и меняются по мере накопления оружием искр. Таким образом, побегав с оружием какое-то время, лишаешь его скрытых тайн и хаотичности, фиксируя эффекты. Но это ещё не всё, после накопления искр через некоторое количество выстрелов хаотическое оружие ломается, оставляя кристаллы-заряды определённой стихии.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/b51/9a6/66c/b519a666c5d9e630156206027600d11b.jpg\" alt=\"Справа внизу видно, что в текущем оружии собрано 4 искры.\" title=\"Справа внизу видно, что в текущем оружии собрано 4 искры.\" width=\"956\" height=\"664\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/b51/9a6/66c/b519a666c5d9e630156206027600d11b.jpg\" data-blurred=\"true\"><figcaption>Справа внизу видно, что в текущем оружии собрано 4 искры.</figcaption></figure><p>Что же это за заряды такие? Дело в том, что имеется ещё такой вид оружия как жезлы. Если экипировать жезл, то он постреливает встроенной слабой магией, которая не тратит маны. Но в жезл также встроены пара заклинаний (огненный шар и молнии), которые расходуют не ману, а те самые кристаллы-заряды. Таким образом предполагается, что игрок периодически экипирует герою хаотическое оружие, ловит в него искры, а когда то оружие разрушается, то может иногда постреливать из жезла накопившимися зарядами.</p><p>По сути в хаотическом оружии как раз действует система умножения идентификаторов, но в несколько упрощённом виде. Также это похоже на концепт <strong>Куба с дарами</strong> из первой статьи, однако тот Куб планировался как вариант полной замены инвентаря вобще, в то время как в этом проекте мне захотелось иметь более развёрнутого (классического) вида инвентарь и концепцию Куба пришлось несколько переделать.</p><p>В другом прототипе, <strong>Wild Engines</strong>, используется концепт <strong>ID-способностей</strong> - машинка подбирает в свой ограниченный инвентарь-рулетку разные предметы и, в зависимости от выставленной комбинации первых двух предметов, получает то или иное активируемое заклинание. Играбельное демо с этой механикой я пока не собирал, а в старой демоверсии этого проекта такой механики ещё нет. В целом это заготовка под такой некоторый \"диаблоид на колёсах\". Кто сказал, что машинки не могут быть магами и зачищать \"подземелья\"?</p><iframe frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" src=\"https://embedd.srv.habr.com/iframe/62ac76a05bce1f4fead98771\" style=\"\" width=\"\" id=\"62ac76a05bce1f4fead98771\" height=\"398\"></iframe><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/479/10b/4b6/47910b4b66a68f220bcb3e68f9168edf.jpg\" alt=\"В инвентаре-рулетке справа выставлена комбинация предметов (верхнее поле), дающая машинке способность дышать огнём. Кнопки по бокам вертят колонки предметов. Кнопки внизу выкидывают предметы из соответствующей колонки в игровой мир (кроме самого верхнего предмета). Подбираемые предметы помещаются в свободные позиции инвентаря-рулетки (но не в верхние поля, куда предмет можно только прокрутить боковыми кнопками).\" title=\"В инвентаре-рулетке справа выставлена комбинация предметов (верхнее поле), дающая машинке способность дышать огнём. Кнопки по бокам вертят колонки предметов. Кнопки внизу выкидывают предметы из соответствующей колонки в игровой мир (кроме самого верхнего предмета). Подбираемые предметы помещаются в свободные позиции инвентаря-рулетки (но не в верхние поля, куда предмет можно только прокрутить боковыми кнопками).\" width=\"1019\" height=\"593\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/479/10b/4b6/47910b4b66a68f220bcb3e68f9168edf.jpg\" data-blurred=\"true\"><figcaption>В инвентаре-рулетке справа выставлена комбинация предметов (верхнее поле), дающая машинке способность дышать огнём. Кнопки по бокам вертят колонки предметов. Кнопки внизу выкидывают предметы из соответствующей колонки в игровой мир (кроме самого верхнего предмета). Подбираемые предметы помещаются в свободные позиции инвентаря-рулетки (но не в верхние поля, куда предмет можно только прокрутить боковыми кнопками).</figcaption></figure><p>Ещё один прототип, <strong>Neverdrome</strong> (на этот раз с демоверсией), демонстрирует работу упоминаемого в статье <strong>Органического инвентаря</strong> (хотя он тут довольно малого размера). Там присутствует ещё одна особенность - влияние предмета снимается немного упрощённым алгоритмом и иногда возникает эффект освобождения лишнего места, поэтому не только порядок укладки, но и последующие перекладки предметов тоже начинают играть свою роль.</p><div class=\"embed_link\"><div class=\"embed__thumb\" style=\"background-image: url(&quot;https://img.itch.zone/aW1nLzkxNDUyODMuanBn/original/9uBFCf.jpg&quot;);\"></div><div class=\"embed__caption\"><div class=\"embed__caption-title\"><span>Neverdrome</span></div><a href=\"https://thenonsense.itch.io/neverdrome\" target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"embed__caption-link\">thenonsense.itch.io</a></div></div><iframe frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\" src=\"https://embedd.srv.habr.com/iframe/62ac83e141d6a34fa4f7f1fd\" style=\"\" width=\"\" id=\"62ac83e141d6a34fa4f7f1fd\" height=\"398\"></iframe><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w780q1/getpro/habr/upload_files/ad2/75e/fe0/ad275efe0952d77ab0a41a46fce45548.jpg\" alt=\"В окне инвентаря (9 ячеек слева) находятся два предмета с полной областью влияния (на все 8 окружающих их клеток). Ячейки заблокированные их областями влияния отмечены &quot;паутиной&quot;.\" title=\"В окне инвентаря (9 ячеек слева) находятся два предмета с полной областью влияния (на все 8 окружающих их клеток). Ячейки заблокированные их областями влияния отмечены &quot;паутиной&quot;.\" width=\"1017\" height=\"594\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/ad2/75e/fe0/ad275efe0952d77ab0a41a46fce45548.jpg\" data-blurred=\"true\"><figcaption>В окне инвентаря (9 ячеек слева) находятся два предмета с полной областью влияния (на все 8 окружающих их клеток). Ячейки заблокированные их областями влияния отмечены \"паутиной\".</figcaption></figure><p> Ну и на этом всё на сегодня.</p><p></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-12T14:32:33.446Z",
      "edit_date": "2022-06-13T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 7,
    "fields": {
      "category": 1,
      "author": 2,
      "title": "Функциональная спецификация интерфейса: что это, зачем нужна, как её писать",
      "image": "article_images\\e6651a94c382844ffc6b4929fe85f705.png",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><p>Функциональная спецификация вместе с прототипом рассказывает, из каких элементов состоит и как работает интерфейс системы. Она описывает то, что трудозатратно, невозможно или бессмысленно показывать в прототипе.</p><p>С её помощью можно улучшить предлагаемые решения, ответить на вопросы разработчиков и других участников проекта, зафиксировать договорённости на бумаге.</p><p>В этой статье я рассказал, как она помогает сделать продукт лучше, что можно включить в спецификацию, как её структурировать, что писать об отдельных элементах интерфейса и что уже выходит за рамки подобного документа.</p><p>Надеюсь, это поможет вам в написании спецификаций для своих интерфейсов.</p><a class=\"anchor\" name=\"0\" id=\"0\"></a><h2>Оглавление</h2><p><a href=\"#1\" rel=\"noopener noreferrer nofollow\">1. Что такое функциональная спецификация</a></p><p><a href=\"#2\" rel=\"noopener noreferrer nofollow\">2. Зачем нужна</a></p><p><a href=\"#3\" rel=\"noopener noreferrer nofollow\">3. Как писать</a></p><p><a href=\"#3.1\" rel=\"noopener noreferrer nofollow\">3.1. Когда к ней приступать</a></p><p><a href=\"#3.2\" rel=\"noopener noreferrer nofollow\">3.2. Состав</a></p><p><a href=\"#3.3\" rel=\"noopener noreferrer nofollow\">3.3. Структура</a></p><p><a href=\"#3.4\" rel=\"noopener noreferrer nofollow\">3.4. Описание элементов</a></p><p><a href=\"#3.5\" rel=\"noopener noreferrer nofollow\">3.5. Описание страниц</a></p><p><a href=\"#4\" rel=\"noopener noreferrer nofollow\">4. Примечания и ссылка на видео</a></p><a class=\"anchor\" name=\"1\" id=\"1\"></a><h2>Что такое функциональная спецификация</h2><p>Функциональная спецификация интерфейса — один из артефактов, который полезно создавать при проектировании интерфейсов. Я её делаю после прототипа, чтобы уточнить показанные в нём решения и ответить на будущие вопросы разработчиков.</p><p>Итоговый документ работает в паре с прототипом и рассказывает, из каких элементов состоит и как работает интерфейс системы. В нём можно описать то, что трудозатратно или невозможно визуализировать в прототипе, и то, что на картинках человек скорее всего не заметит.</p><p>Например:</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/12f/14c/651/12f14c651cedc67f56bc038ff9579156.png\" alt=\"1. Приложение сигнализации, список пользователей\" title=\"1. Приложение сигнализации, список пользователей\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/12f/14c/651/12f14c651cedc67f56bc038ff9579156.png\"><figcaption>1. Приложение сигнализации, список пользователей</figcaption></figure><p>Разработчики спросят, как упорядочен список пользователей? На картинке ответа нет. Я решил, что упорядочены они по дате и времени подключения, поэтому в спецификации надо написать:</p><ol><li><p>Пользователи упорядочены по дате и времени регистрации на объекте в прямом хронологическом порядке.</p></li><li><p>Доверенные лица упорядочены по дате и времени добавления в прямом хронологическом порядке.</p></li></ol><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/8d8/033/f3d/8d8033f3d0e551ad12f0b0d2b020f904.png\" alt=\"2. Приложение сигнализации, настройка тегов местоположения\" title=\"2. Приложение сигнализации, настройка тегов местоположения\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/8d8/033/f3d/8d8033f3d0e551ad12f0b0d2b020f904.png\"><figcaption>2. Приложение сигнализации, настройка тегов местоположения</figcaption></figure><p>На картинке со списком тегов — реалистичные данные. Из них следует, что список упорядочен в прямом алфавитном порядке. Но разработчики могут не обратить на это внимания. И вообще не факт, что подобную информацию они станут искать в прототипе. Значит, в спецификации стоит написать:</p><ol><li><p>Теги упорядочены в прямом алфавитном порядке.</p></li></ol><p>Функциональная спецификация интерфейса — не техническое задание на создание продукта. Она описывает только логику работы отдельных элементов интерфейса и их совокупностей (страниц, экранов). Техническое задание может содержать важные характеристики продукта: производительность, на каких устройствах и операционных системах он должен работать без нареканий, требования к вёрстке и так далее.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/3a5/e83/1d5/3a5e831d5689b1959c931262b8a42ceb.png\" alt=\"3. Приложение сигнализации, установка пинкода на вход\" title=\"3. Приложение сигнализации, установка пинкода на вход\" width=\"320\" height=\"549\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/3a5/e83/1d5/3a5e831d5689b1959c931262b8a42ceb.png\"><figcaption>3. Приложение сигнализации, установка пинкода на вход</figcaption></figure><p>В приложении можно управлять сигнализацией, поэтому вход в него полезно защитить пинкодом. Это обязательно, если пользовательский телефон сам пинкодом не защищён (раньше такое часто встречалось). А если защищён, отображается кнопка «Не устанавливать код на вход», и шаг установки пинкода не обязателен. Эта логика может быть описана в спецификации:</p><ol><li><p>Установка пинкода на вход в приложение происходит после регистрации пользователя на объекте, если пользователь приложения не пропустил этот шаг или не установил пинкод ранее.</p></li><li><p>Если телефон не защищён пинкодом, пользователь не может пропустить этот шаг, кнопка «Не устанавливать код на вход» не отображается.</p></li></ol><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/aa0/e17/8cd/aa0e178cdd5134777de29b98cd8489ed.png\" alt=\"4. Приложение сигнализации, меню со списком объектов\" title=\"4. Приложение сигнализации, меню со списком объектов\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/aa0/e17/8cd/aa0e178cdd5134777de29b98cd8489ed.png\"><figcaption>4. Приложение сигнализации, меню со списком объектов</figcaption></figure><p>Пользователь может зарегистрироваться на нескольких объектах, тогда в приложении появится список, чтобы переключаться между ними. От названий объектов в списке отображаются только первые буквы: «Квартира» → «К», «Дача» → «Д», «Гараж» → «Г». А от названий, начинающихся одинаково, — буквы с порядковыми номерами: «К1», «К2» и «К3».</p><p>Сложно с помощью одних лишь картинок передать это решение и ответить на вопрос: что будет с порядковыми номерами, когда пользователь отключится от объекта, обозначенного «К1»? Возможно, обозначения «К2» и «К3» стоит сохранить за оставшимися объектами, так как человек мог к ним привыкнуть. В спецификации это можно описать:</p><ol><li><p>Если у пользователя приложения несколько объектов с названиями на одну и ту же букву, отображаются буквы и порядковые номера. Номера присваиваются по мере регистрации пользователя на этих объектах. Например, «К1», «К2» и «К3» — это объекты, названия которых начинаются с буквы «К». Сначала пользователь зарегистрировался на «К1».</p></li><li><p>Если пользователь отключается от «К1», обновлять порядковые номера не надо, чтобы за оставшимися объектами сохранились привычные пользователю обозначения «К2» и «К3».</p></li></ol><p>Кстати, на этом примере можно проиллюстрировать два полезных приёма: 1) дополнять тезисы примерами, чтобы было понятнее, 2) кратко объяснять не самые очевидные решения. Об этом стоило написать в разделе «Как писать функциональную спецификацию», но здесь уж очень удобный пример подвернулся.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"2\" id=\"2\"></a><h2>Зачем нужна функциональная спецификация</h2><p>1. Донести решения, которые не видны в прототипе.</p><p>2. Стать источником ответов на возможные вопросы разработчиков, тестировщиков, менеджеров и других людей, которые будут работать с прототипом. Без такого источника они будут спрашивать дизайнера и откладывать задачи, пока ответов нет. Или придумывать свои ответы и делать как-нибудь (и потом, в лучшем случае, переделывать). Дизайнер может уйти из компании, а в заказной разработке — сдать свой этап работ и забыть детали проекта или просто перестать отвечать на вопросы.</p><p>Спецификация нужна при разработке любых более-менее сложных интерфейсов. Полезной она будет даже для лендинга, если на нём есть калькулятор, конфигуратор или форма заказа.</p><p>3. Стать частью договора. В отличие от интерактивного прототипа спецификацию легко распечатать и подписать. Фиксировать договорённости полезно не только с внешними контрагентами, но и с собственными коллегами. Внутри команды без такого договора тоже иногда бывает тяжко. Особенно удобно, если можно видеть, кто прочитал документ и задал вопросы.</p><p>4. Проверить свои решения ещё раз. Разные артефакты проектирования можно сравнить с разным размером ячеек в сите, с помощью которого просеиваются проектные решения. Прототип — крупная ячейка, выявляющая большие недочёты в логике работы проектируемой системы. Спецификация — мелкая ячейка, помогающая найти недочёты небольшие.</p><p>Примеры доработки решений, показанных в прототипе:</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/021/a85/961/021a85961ac600e2120d792c5b551f96.png\" alt=\"5. Приложение сигнализации, вход\" title=\"5. Приложение сигнализации, вход\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/021/a85/961/021a85961ac600e2120d792c5b551f96.png\"><figcaption>5. Приложение сигнализации, вход</figcaption></figure><p>Чтобы войти в приложение, некоторым пользователям приходится вводить пинкод. При описании кнопки «Войти» я отвечаю на вопросы: надо ли её блокировать по умолчанию; как отреагирует система на нажатие, если пинкод не введён? При этом может появиться мысль: зачем нужна кнопка, если пускать в приложение можно сразу после ввода корректного пинкода? Стоит убрать кнопку и описать это поведение в спецификации.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/41c/2b9/4d2/41c2b94d22b01769fd8001372b2b0bc7.png\" alt=\"6. Приложение сигнализации, подтверждение номера телефона\" title=\"6. Приложение сигнализации, подтверждение номера телефона\" width=\"320\" height=\"549\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/41c/2b9/4d2/41c2b94d22b01769fd8001372b2b0bc7.png\"><figcaption>6. Приложение сигнализации, подтверждение номера телефона</figcaption></figure><p>Пользователь подтверждает номер телефона, который он указал на предыдущем шаге. Описывая абзац с номером телефона, я вспоминаю, зачем вообще решил его показывать? Чтобы можно было проверить, нет ли ошибки в номере, если смс долго не приходит. Может возникнуть вопрос: а если номер неправильный, как это исправить? Нужна возможность изменить номер или вернуться на предыдущий шаг.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/6bc/386/940/6bc386940ee64e4cfad59c25be5bab20.png\" alt=\"7. Приложение сигнализации, пустой список пользователей и доверенных лиц\" title=\"7. Приложение сигнализации, пустой список пользователей и доверенных лиц\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/6bc/386/940/6bc386940ee64e4cfad59c25be5bab20.png\"><figcaption>7. Приложение сигнализации, пустой список пользователей и доверенных лиц</figcaption></figure><p>Я показал состояние с пустым списком пользователей на конкретном объекте. Пересматривая юзерфлоу (user flow) первоначальной настройки сигнализации, я понимаю, что главный пользователь появляется ещё до завершения настройки нового объекта. Значит, он уже должен быть в этом списке. Надо исправить.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/fbe/af4/e1f/fbeaf4e1fab00c2e36a43195274713c8.png\" alt=\"8. Приложение сигнализации, настройка уведомлений\" title=\"8. Приложение сигнализации, настройка уведомлений\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/fbe/af4/e1f/fbeaf4e1fab00c2e36a43195274713c8.png\"><figcaption>8. Приложение сигнализации, настройка уведомлений</figcaption></figure><p>Пользователь указывает, как хотел бы узнавать о сработавшей сигнализации: с помощью пуша, смс, имейла или всеми возможными способами. Прорабатывая уведомления по электронной почте, разработчики спросят, на какой адрес отправлять письмо? При регистрации пользователь вводит только номер телефона, значит, при выборе этого способа оповещения должно появляться поле для ввода адреса почты. Плюс, адрес надо ещё подтвердить, а до этого уведомление по электронной почте работать не будет (надо показать ещё одно состояние).</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3\" id=\"3\"></a><h2>Как писать функциональную спецификацию</h2><a class=\"anchor\" name=\"3.1\" id=\"3.1\"></a><h3>Когда к ней приступать</h3><p>Я начинаю писать спецификацию после появления финальной версии прототипа. На этапе прототипирования видение продукта может сильно меняться. И если в прототипе поменять всё относительно просто, то переписывать текст уже не так легко. Части экранов вообще может не оказаться в новой итерации прототипа — есть опасность стереть строк больше, чем выдал. В заказной разработке даже оценивать стоимость написания спецификации лучше после создания прототипа.</p><p>Стоит учитывать, что после прототипа появятся дизайн-макеты, которые конкретизируют дизайн. Например, количество превьюшек в галерее. Прототип покажет их количество приблизительно, так как оно зависит от системы отступов, конкретных размеров картинок и самой галереи, которые будут определены уже в макетах.</p><p>Если основная задача спецификации — ещё раз проверить и улучшить свои решения, можно написать что-то вроде «Кнопки для прокрутки списка превью отображаются, если изображений в галерее больше N (количество определяется на этапе дизайна)». Если главное — договориться и подготовить проект к разработке, спецификацию придётся обновить после создания дизайн-макетов. Или можно отложить её написание до появления финальных макетов.</p><p>С другой стороны, одновременно с прототипированием в спецификации можно фиксировать отдельные решения (чтобы не вспоминать потом) и записывать открытые вопросы.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.2\" id=\"3.2\"></a><h3>Состав</h3><p>Базовый состав спецификации:</p><ul><li><p>Титульный лист.</p></li><li><p>Оглавление.</p></li><li><p>Описания типовых элементов интерфейса:</p><ul><li><p>Для продукта в целом.</p></li><li><p>Для его разделов или модулей.</p></li></ul></li><li><p>Описания отдельных страниц (экранов, блоков на длинных страницах). Для каждой страницы:</p><ul><li><p>Её работа в целом.</p></li><li><p>Состав и поведение её элементов.</p></li><li><p>Модальные окна, сообщения об ошибках, особые случаи.</p></li></ul></li></ul><p>Выделение типовых элементов позволяет не дублировать описания одних и тех же элементов на разных страницах. Типовыми для продукта в целом бывают: шапка, главное меню, подвал, поле поиска, форма подписки на рассылку, лайтбокс просмотра галереи, капча, подсказка и так далее. Для отдельного модуля вроде новостного раздела: меню раздела, блок «Самые популярные новости».</p><p>Можно добавить:</p><ul><li><p>Введение и общее описание продукта.</p></li><li><p>Описания основных сущностей продукта и определения терминов из предметной области. Например, для конфигуратора одежды, который появится в примерах ниже: нанесение, область нанесения.</p></li><li><p>Определения технических терминов из спецификации. Например: контрол, лайтбокс, алерт, внешняя часть системы.</p></li><li><p>Структуры конкретных разделов или модулей продукта.</p></li><li><p>При описании отдельной страницы:</p><ul><li><p>Зачем она вообще нужна, какую задачу решает. Даже краткое описание в 1–2 предложения может оказаться очень полезным.</p></li><li><p>Изображение её основного состояния.</p></li><li><p>Изображения всех её состояний.</p></li></ul></li></ul><p>Межэкранную логику в спецификации лучше не описывать. Для этого больше подходят сценарии и, если логика разветвлённая, диаграммы юзерфлоу.</p><p>Что добавлять в спецификацию, зависит от того, кто и как будет ей пользоваться, и готов ли дизайнер такое содержимое подготовить. Документ с изображениями лучше решает задачу «Стать частью договора» и позволяет ознакомиться с проектом, не открывая прототипа. Описание продукта в целом, его основных сущностей и смысла отдельных страниц упрощает подключение новых людей к работе над продуктом. Словарь терминов помогает всем говорить на одном языке.</p><p>Идеально, если все состояния прототипа показаны в спецификации картинками. Можно не перелинковывать её с прототипом, и читателям не придётся изучать два артефакта параллельно. Но это трудоёмко, и без интерактивного прототипа всё равно не обойтись — сложнее оценивать удобство интерфейса.</p><p>Можно писать спецификацию в прототипе (в Акшуре или Фигме), но работать с текстом в подобных средах сложнее, чем в текстовом редакторе. И нельзя просто так взять и распечатать её.</p><p>Если спецификация работает в паре с прототипом, важно не забыть сослаться на него во введении или на титульном листе.</p><p>Также на титульном листе можно разместить:</p><ul><li><p>Название проекта.</p></li><li><p>Информацию об авторах.</p></li><li><p>Версию документа и дату последней редакции.</p></li><li><p>Список предыдущих версий с кратким описанием изменений.</p></li></ul><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.3\" id=\"3.3\"></a><h3>Структура</h3><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/554/288/d78/554288d78f11ed1f63a40978b5abccf8.png\" alt=\"9. Конфигуратор одежды, структура спецификации\" title=\"9. Конфигуратор одежды, структура спецификации\" width=\"1580\" height=\"1560\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/554/288/d78/554288d78f11ed1f63a40978b5abccf8.png\"><figcaption>9. Конфигуратор одежды, структура спецификации</figcaption></figure><p>На картинке — структура самой базовой спецификации для конфигуратора одежды, разделённого на 6 этапов. В первом разделе описаны типовые элементы, которых совсем немного. В остальных разделах — этапы и отдельные шаги на этих этапах.</p><p>Сейчас я бы убрал описания шагов «Выбор подтипа изделия» и «Сообщение об оформленном заказе» в подразделы, чтобы разделы спецификации совпадали с видимыми в интерфейсе этапами конфигуратора. Объём информации позволяет так сделать.</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/9d0/c42/d9b/9d0c42d9b0f4247d70ff1afa18468236.png\" alt=\"10. Конфигуратор одежды, список этапов в интерфейсе\" title=\"10. Конфигуратор одежды, список этапов в интерфейсе\" width=\"1920\" height=\"206\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/9d0/c42/d9b/9d0c42d9b0f4247d70ff1afa18468236.png\"><figcaption>10. Конфигуратор одежды, список этапов в интерфейсе</figcaption></figure><p>Но я не стал переделывать пример: 1) артефакты редко бывают идеальными, 2) не хотел отступать от изначального содержимого доклада, на котором основывается эта статья, 3) нет какой-то единственно верной структуры спецификации.</p><p>Я придерживаюсь принципа: если появляются заголовки пятого уровня, возможно, продукт слишком большой и отдельные его части стоит описывать в отдельных документах. Либо спецификация пытается соответствовать структуре продукта. Даже если осуществимо (дерево может быть очень глубоким), это не даёт особых преимуществ при чтении спецификации.</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/66b/b8e/3d8/66bb8e3d8351c74bcad026d124fc64c5.png\" alt=\"11. Фрагмент структуры спецификации с описанием части сайта для неавторизованных пользователей\" title=\"11. Фрагмент структуры спецификации с описанием части сайта для неавторизованных пользователей\" width=\"1588\" height=\"540\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/66b/b8e/3d8/66bb8e3d8351c74bcad026d124fc64c5.png\"><figcaption>11. Фрагмент структуры спецификации с описанием части сайта для неавторизованных пользователей</figcaption></figure><p>Описание типовых элементов интерфейса, которые встречаются только в конкретном модуле (вроде части сайта для неавторизованного пользователя), можно разместить в разделе спецификации, посвящённом этому модулю, — как на картинке. Либо все типовые элементы, встречающиеся по всему продукту и в отдельных модулях, можно описать в одном разделе, посвящённом типовым элементам. Выбор зависит от структуры продукта, количества типовых элементов, их распределения по модулям продукта и личных предпочтений дизайнера (тоже немаловажный фактор).</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/b00/e84/834/b00e84834efb91a2f71ed93781d48f87.png\" alt=\"12. Конфигуратор одежды, описание шага выбора типа изделия\" title=\"12. Конфигуратор одежды, описание шага выбора типа изделия\" width=\"1580\" height=\"780\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/b00/e84/834/b00e84834efb91a2f71ed93781d48f87.png\"><figcaption>12. Конфигуратор одежды, описание шага выбора типа изделия</figcaption></figure><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/c54/25e/ce2/c5425ece20d1bfa45d7bbb85badfd3b6.png\" alt=\"13. Конфигуратор одежды, описание типового элемента\" title=\"13. Конфигуратор одежды, описание типового элемента\" width=\"1580\" height=\"450\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/c54/25e/ce2/c5425ece20d1bfa45d7bbb85badfd3b6.png\"><figcaption>13. Конфигуратор одежды, описание типового элемента</figcaption></figure><p>Как я писал выше, можно сначала описать типовой элемент, а затем ссылаться на него при описании страниц, на которых он встречается. На конкретной странице часть его свойств можно переопределить или дополнить. Например, можно указать, что на странице с поисковой выдачей поле поиска будет по умолчанию заполнено, или добавить текст конкретной подсказки, никак не касаясь типовой логики её отображения.</p><p>Некоторые типовые элементы на странице можно даже не упоминать. Например, в описании списка шагов конфигуратора можно указать, что он есть на всех страницах конфигуратора, если не указано обратное.</p><p>Заголовки и все абзацы стоит нумеровать, чтобы можно было сослаться на подраздел (например, на описание компонента в §1.1) или обсудить конкретный тезис (информацию о типе изделия в §2, пункте 2.d).</p><blockquote><p>Дополнение Марины Пустовит: Вигерс приводит классный способ нумерации. Смысл в том, что цифры не очень информативны. В многоуровневом документе номер параграфа 4.6.2.1.7 не помогает читателю понять, где в документе он находится и о чём там речь. Вместо этого можно нумеровать словами, а также комбинировать слова и цифры, например: «Слово.Слово.Слово.1.2».</p></blockquote><p>Сам я так не делал, но раз Вигерс советует, а Марина практикует, идея стоит упоминания.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.4\" id=\"3.4\"></a><h3>Описание элементов</h3><p>Чтобы описать страницу (экран, блок на длинной странице), для начала можно выписать, какие элементы интерфейса на ней есть, и рассмотреть их по отдельности.</p><p>Полезные вопросы для описания любого элемента интерфейса:</p><ul><li><p>Когда не отображается?</p></li><li><p>Из чего состоит?</p></li><li><p>Какие составные части могут отсутствовать или быть неактивными и почему?</p></li><li><p>Как пользователь может с ним взаимодействовать. Что при этом происходит?</p></li><li><p>В каких состояниях элемент может находиться?</p></li><li><p>Как при наведении на него меняется курсор?</p></li></ul><p>Например:</p><p>В новостной ленте каждая новость состоит из заголовка, текста, даты-времени и картинки. Если редактор не нашёл подходящего изображения, будет отображаться картинка-заглушка или альтернативный дизайн новости (без картинки)?</p><p>Изменение стрелки на текстовый курсор ⌶ при наведении на текст подсказывает, что пользователь прямо сейчас может его отредактировать. Иногда ответить на вопрос о поведении курсора довольно непросто, например: «Надо ли превращать курсор в палец над кнопками на сайтах?».</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e66/51a/94c/e6651a94c382844ffc6b4929fe85f705.png\" alt=\"14. Конфигуратор одежды, галерея изображений\" title=\"14. Конфигуратор одежды, галерея изображений\" width=\"1900\" height=\"1240\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/e66/51a/94c/e6651a94c382844ffc6b4929fe85f705.png\"><figcaption>14. Конфигуратор одежды, галерея изображений</figcaption></figure><p>В галерее изображений можно переключать вертикальный список превью. К чему приведёт нажатие на нижнюю иконку шеврона: к отображению одного нового превью или блока из семи новых картинок? А если есть только три новых картинки, на экране будут они и пустое место или три новых и четыре старых картинки? Если новых картинок нет, шеврон станет неактивным, пропадёт или прокрутит список картинок в самое начало? Вот часть спецификации:</p><ol><li><p>Кнопки для прокрутки списка превью отображаются, если изображений в галерее больше N (количество определяется на этапе дизайна).</p></li><li><p>Нажатие приводит к прокрутке списка и отображению следующих N превью.</p></li><li><p>Если следующих превью меньше N, отображаются все новые превью и часть старых, из предыдущей группы.</p></li><li><p>Если следующих превью нет, кнопка не отображается.</p></li></ol><p>Полезные вопросы для описания элементов интерфейса определённого типа:</p><p>1. Список и таблица:</p><ul><li><p>Из чего состоит элемент списка?</p></li><li><p>Сколько элементов списка отображается на странице?</p></li><li><p>Когда отображается постраничная навигация?</p></li><li><p>Как упорядочен по умолчанию? Например: в прямом алфавитном порядке по названию, в обратном хронологическом по дате публикации.</p></li><li><p>Что будет, если в списке не окажется ни одного элемента?</p></li></ul><p>2. Кнопка:</p><ul><li><p>Когда может быть неактивной?</p></li><li><p>Что происходит при нажатии активной и неактивной кнопки?</p></li><li><p>Как ведёт себя, чтобы не допустить двойного нажатия и двойной отправки данных?</p></li><li><p>Какие вызывает сообщения об ошибках заполнения формы?</p></li></ul><p>Если кнопка неактивна, полезно сообщать пользователю, почему так и как её активировать. Например, при наведении на неё курсора.</p><p>3. Поле формы:</p><ul><li><p>Тип поля?</p></li><li><p>Обязательно ли для заполнения?</p></li><li><p>Есть ли требования к вводимым данным? Например, можно вводить только цифры.</p></li><li><p>Минимальные и максимальные значения?</p></li><li><p>Значение по умолчанию? Например: на странице с поисковой выдачей поле поиска по умолчанию заполнено пользовательским запросом; на странице регистрации флаг в чекбоксе «Подписаться на новости компании» по умолчанию установлен.</p></li><li><p>Наличие или отсутствие плейсхолдера?</p></li><li><p>Текст плейсхолдера, если он не показан в прототипе?</p></li><li><p>Текст сообщений об ошибках?</p></li><li><p>Когда сообщения об ошибках будут отображаться: во время заполнения формы или в момент её отправки? Если во время заполнения, то когда именно? Например, когда поле теряет фокус.</p></li><li><p>Связь с другими полями формы и элементами страницы? Например: если флаг в чекбоксе «Уведомлять по электронной почте» установлен, отображается поле для ввода адреса электронной почты.</p></li></ul><p>4. Поле поиска:</p><ul><li><p>Когда отображаются и как работают подсказки?</p></li><li><p>Появляется ли кнопка очистки поля?</p></li><li><p>Реагирует ли на нажатие клавиш? Например, нажатие на Enter приводит к отображению поисковой выдачи.</p></li></ul><p>5. Контент:</p><ul><li><p>Откуда появляется?</p></li><li><p>По каким принципам генерируется? Решение с обозначениями «К1» и «К2» в примере в начале статьи, возможно, не самое удачное, но оно записано и его можно обсуждать.</p></li><li><p>Как пользовательские данные влияют на поведение системы?</p></li></ul><p>Примеры влияния пользовательских данных:</p><p>В форме заказа пользователь выбирает регион. В одних регионах заказы обслуживает сама компания, в остальных — региональные партнёры. Специалисты компании работают в CRM, а партнёры получают заказы по электронной почте. Во втором случае потребуется шаблон электронного письма.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/34f/cc3/db0/34fcc3db020cf46472746e0c119793f4.png\" alt=\"15. Приложение сигнализации, сообщение о датчике, который сработал при включении сигнализации\" title=\"15. Приложение сигнализации, сообщение о датчике, который сработал при включении сигнализации\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/34f/cc3/db0/34fcc3db020cf46472746e0c119793f4.png\"><figcaption>15. Приложение сигнализации, сообщение о датчике, который сработал при включении сигнализации</figcaption></figure><p>Пользователь может включить сигнализацию, не закрыв окно в детской. Может быть, он просто забыл или специально оставил детскую проветриваться. В этом случае, если сигнализация включена, закрытие окна приведёт к отправке уведомления, а повторное его открытие — к тревоге.</p><p>Пользователь видит текст о датчике и логике работы сигнализации и может решить: закрыть окно или спокойно уйти, так как день не ветреный и окно само не захлопнется. Экран с этим сообщением появился уже при написании спецификации, когда я прикидывал, какими могут быть пользовательские данные (показания датчиков) при включении сигнализации.</p><p>И в заключение параграфа — пример элемента с нетиповым взаимодействием:</p><figure class=\"bordered full-width \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/1d7/8a7/77b/1d78a777b740c809f476eceef38c6c6f.png\" alt=\"16. Конфигуратор одежды, редактирование нанесения в виде картинки\" title=\"16. Конфигуратор одежды, редактирование нанесения в виде картинки\" width=\"1430\" height=\"1230\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/1d7/8a7/77b/1d78a777b740c809f476eceef38c6c6f.png\"><figcaption>16. Конфигуратор одежды, редактирование нанесения в виде картинки</figcaption></figure><p>Пользователь добавляет на футболку нанесение в виде текста или изображения. У любого нанесения есть два состояния: просмотр и редактирование. Нанесения не могут пересекаться — это техническое ограничение процесса печати и вышивки на одежде. Чтобы отредактировать нанесение, надо на него нажать.</p><p>Описание взаимодействия, включающее реакцию на некоторые клавиши:</p><ol><li><p>Нажатие на нанесение приводит к его выделению и отображению его настроек.</p></li><li><p>Нажатие на второе нанесение, когда первое выделено, приводит к скрытию настроек первого и отображению настроек второго.</p></li><li><p>Нанесения не могут пересекаться.</p></li><li><p>Выделенное нанесение удаляется, если пользователь нажимает клавишу Delete или Backspace. Не работает в режиме редактирования текста в текстовом нанесении.</p></li></ol><p>В режиме редактирования нанесение можно перемещать, масштабировать и поворачивать. Возникают вопросы: с каким шагом в градусах его можно поворачивать; что если пользователь переместит его за пределы области нанесения?</p><ol><li><p>Пользователь поворачивает нанесение, удерживая его за специальный контрол, нанесение поворачивается в заданную пользователем сторону с шагом в 90 градусов.</p></li><li><p>Пользователь перемещает нанесение, удерживая его за специальный контрол.</p></li><li><p>Пользователь может переместить его за пределы области нанесения, но не далее рабочей области. При этом:</p><ol><li><p>Часть нанесения, оказавшаяся за пределами области нанесения, не отображается.</p></li><li><p>Контур нанесения и связанные с ним контролы настройки отображаются и за пределами области нанесения.</p></li></ol></li></ol><p>Состояние с объектом, оказавшимся за пределами области нанесения (с контуром и частично скрытым текстом или изображением), надо показать в прототипе.</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"3.5\" id=\"3.5\"></a><h3>Описание страниц</h3><p>Поведение системы не всегда связано с конкретными элементами на странице. В этом случае можно описать поведение страницы в целом.</p><figure class=\"bordered \"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/e5c/1d4/bc7/e5c1d4bc751c9e9ba3f6a6f78011ae06.png\" alt=\"17. Приложение сигнализации, пользовательское соглашение\" title=\"17. Приложение сигнализации, пользовательское соглашение\" width=\"320\" height=\"548\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/e5c/1d4/bc7/e5c1d4bc751c9e9ba3f6a6f78011ae06.png\"><figcaption>17. Приложение сигнализации, пользовательское соглашение</figcaption></figure><p>Экран с пользовательским соглашением появляется при первом запуске приложения и при каждом изменении соглашения. Вопрос: когда пользователь увидит его во второй раз, не решит ли он, что это сбой в матрице, ведь он уже соглашался с условиями? Возможно, стоит предусмотреть дополнительное состояние экрана на случай, когда соглашение изменится. Вот описание экрана «Пользовательское соглашение»:</p><ol><li><p>Экран отображается:</p><ol><li><p>При первом запуске приложения до тех пор, пока пользователь не подтвердит согласие с условиями пользовательского соглашения.</p></li><li><p>При открытии приложения в случае, если текст соглашения был изменён и требует нового согласия пользователя. В этом случае текст соглашения будет начинаться со слов о том, что соглашение было изменено.</p></li></ol></li></ol><p>В итоге решили обойтись без дополнительного состояния.</p><p>Что если пользователь открывает приложение из-за тревоги, а соглашение изменилось? В этот момент неуместно просить ознакомиться с новой версией документа, даже если он написан человеческим, а не юридическим языком. Это тоже стоит добавить в спецификацию.</p><p>Тревога и наличие нескольких объектов приводит к появлению межэкранной логики:</p><ol><li><p>Когда у пользователя более одного объекта, после входа он переходит:</p><ol><li><p>Если тревоги нет — на экран со включённой или выключенной сигнализацией последнего выбранного объекта.</p></li><li><p>Если тревога у одного объекта — на экран тревоги этого объекта.</p></li><li><p>Если тревога у двух и более объектов — в главное меню.</p></li></ol></li></ol><p>Эта логика может быть зафиксирована в описании кнопки «Войти», но лучше её вынести в документ со сценариями или юзерфлоу. Особенно, если войти в приложение можно с помощью других кнопок (например, через соцсети).</p><p><a href=\"#0\" rel=\"noopener noreferrer nofollow\">К оглавлению</a></p><a class=\"anchor\" name=\"4\" id=\"4\"></a><h2>Примечания</h2><p>Это текстовая версия моего доклада о функциональной спецификации интерфейса с конференции БИФ, прошедшей четыре года назад. С тех пор материал не сильно устарел, но эта статья — не просто транскрипт. Я постарался сделать её понятнее доклада: переработал структуру, уточнил формулировки, убрал краткий рассказ об артефактах проектирования и лишние примеры, добавил важные уточнения. Есть <a href=\"https://www.youtube.com/watch?v=XaRymaGcPXM\" rel=\"noopener noreferrer nofollow\"><u>запись доклада</u></a> (41 минута), но статья лучше, и читать её всего 15 минут.</p><p>Спасибо Марине Пустовит, Даниилу Скрыльникову и Егору Камелеву за комментарии, которые помогли дополнить статью и упростить её для восприятия.</p><p>…</p><p>Подписывайтесь на мой телеграм-канал <a href=\"https://t.me/uxnotes\" rel=\"noopener noreferrer nofollow\"><u>UX Notes</u></a>!</p><p></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-11T14:32:33.446Z",
      "edit_date": "2022-06-12T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 8,
    "fields": {
      "category": 2,
      "author": 3,
      "title": "ChainOps или DevOps",
      "image": "article_images\\1e14308161a4958b20c8c1bff56e64c7.png",
      "description": "<div id=\"post-content-body\"><div><div class=\"article-formatted-body article-formatted-body article-formatted-body_version-2\"><div xmlns=\"http://www.w3.org/1999/xhtml\"><p>В настоящее время все в пространстве DevOps связано со словом, оканчивающимся на ops: GitOps, AIOps, MLOps, DevSecOps, EverythingOps.&nbsp;Хотя, возможно, это уже упоминалось в другом месте, я хочу написать некоторые точки зрения о том, как применять процессы DevOps к блокчейнам и/или технологиям распределенного реестра (&nbsp;<em>DLT</em>&nbsp;).</p><p>Например, просто для описания одного из этих так называемых терминов «эксплуатация»: «GitOps — это операционная среда, которая использует лучшие практики DevOps, используемые для разработки приложений, такие как контроль версий, совместная работа, соответствие требованиям и CI/CD, и применяет их к автоматизации инфраструктуры.&nbsp;Сразу приходят на ум инструменты инфраструктуры как кода, такие как Terraform.</p><p>ChainOps (с моей точки зрения) следует использовать для описания методов DevOps, выполняемых прямо в пространстве блокчейна.</p><p>В децентрализованном мире основным участником разработки приложений или&nbsp;<em>Dapps</em>&nbsp;(децентрализованных приложений) является&nbsp;<strong>узел</strong>&nbsp;,&nbsp;<strong>узел</strong>&nbsp;в&nbsp;<em>DLT</em>&nbsp;(технология распределенного реестра) — это минимальный компонент инфраструктуры, способный запускать необходимое программное обеспечение, чтобы быть функциональной частью. бухгалтерской книги.</p><p>Таким образом, Devops должен отвечать за то, чтобы каждый узел имел одинаковые сетевые и инфраструктурные возможности (например, ОЗУ, ЦП, пропускную способность), а также одинаковые версии пакетов программного обеспечения.&nbsp;(Например, версии биткойн-ядра или версии DappNode)</p><p>Автоматизированные рабочие процессы DevOps должны отвечать за доставку и интеграцию не только версий основного узла, но и другого программного обеспечения, необходимого для&nbsp;<em>Dapp</em>&nbsp;.</p><p>Наконец, DevOps должен позаботиться о мониторинге, оповещении и, по сути, об измерении ключевых показателей производительности на каждом узле, чтобы применять настройки на основе всех данных, полученных агентами мониторинга.</p><p><br>С точки зрения инфраструктуры блокчейн — это цепочка узлов, которые имеют одно и то же программное обеспечение для вычислений и соединения с другими узлами, с точки зрения devops децентрализованная архитектура предлагает определенные преимущества, поскольку каждый узел или экземпляр точно такие же, как и другие. Хотя масштабируемость и высокая доступность не полностью достижимы, отчасти из-за синхронизации БД (каждый узел должен иметь одни и те же данные) среди других причин.<br><br>Вероятно, лучший способ начать рабочий процесс Devops для блокчейна (или DLT) — это использовать Terraform, код terraform должен отвечать за определение базовой сети и экземпляров, на которых должно работать программное обеспечение узла. Также Terraform дает возможность легко взаимодействовать с различными облаками без необходимости писать</p><p>Рабочий процесс GitOps должен быть настроен в Github/Gitlab/Bitbucket и т. д., чтобы разрешить реализацию CI/CD для кода или модулей Terraform.</p><p>Terraform также можно использовать для развертывания настраиваемых экземпляров с помощью, например, Packer, но это сильно влияет на время, необходимое для предоставления функций для блокчейна и/или узлов. Лично я предпочитаю, чтобы Terraform брал на себя определение общей инфраструктуры, а затем написать Ansible playbook для одновременного развертывания настроенного программного обеспечения на многих узлах, таким образом разделив развертывание инфраструктуры и сети и развертывание программного обеспечения.</p><p>Единственная часть, связанная с программным обеспечением, которую должна выполнить terraform, — это «упаковка» настроенного ami (или базового образа) с минимальным программным обеспечением, необходимым (если таковое имеется) для развертывания программного обеспечения узла.</p><p>В заключение, ChainOps — это сводка лучших практик и инструментов, которые позволяют реализовать автоматизацию инфраструктуры и конвейеры CI/CD, необходимые для развертывания&nbsp;<em>Dapps</em>&nbsp;и&nbsp;<strong>узлов</strong>&nbsp;подготовки на&nbsp;<em>DLT.</em><br><br></p></div></div></div> <div class=\"v-portal\" style=\"display: none;\"></div></div>",
      "create_date": "2022-06-10T14:32:33.446Z",
      "edit_date": "2022-06-11T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 9,
    "fields": {
      "category": 4,
      "author": 3,
      "title": "Где смотреть статистику Telegram-каналов и как анализировать показатели?",
      "image": "article_images\\f44cc4dc6294731d0362635e6cb60994.png",
      "description": "<div xmlns=\"http://www.w3.org/1999/xhtml\"><p>27 апреля&nbsp;<a href=\"https://tgstat.ru/\" rel=\"noopener noreferrer nofollow\">tgstat.ru</a>&nbsp;серьёзно обновился: дизайн стал приятнее, функционал — шире, аналитика — глубже. Если хотите не потеряться в куче метрик и делать объективные выводы исходя из данных о Telegram-каналах — это руководство должно помочь.</p><h3>Как посмотреть на все каналы определённой тематики?</h3><p>Предположим, что вам нужно оценить конкурентов в определённой нише. Тогда логичнее всего будет зайти на главную страницу TGStat, пролистать немного вниз и выбрать из списка категорий подходящую вам.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/747/706/79f/74770679fd4ee1a9e965870d8fe8bec2.webp\" alt=\"Вот так выглядит список доступных категорий Telegram-каналов в TGStat\" title=\"Вот так выглядит список доступных категорий Telegram-каналов в TGStat\" width=\"1496\" height=\"339\"><figcaption>Вот так выглядит список доступных категорий Telegram-каналов в TGStat</figcaption></figure><h3>Как найти определённый канал?</h3><p>Если хотите проанализировать какой-то конкретный канал — просто найдите вверху страницы строку для поиска и вставьте туда свою ссылку.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/17a/40d/f7b/17a40df7b43d98ec0598068fc3202481.webp\" alt=\"В самом верху страницы TGStat — поиск по каналам, чатам\" title=\"В самом верху страницы TGStat — поиск по каналам, чатам\" width=\"1498\" height=\"293\"><figcaption>В самом верху страницы TGStat — поиск по каналам, чатам</figcaption></figure><h3>Как анализировать данные из разных разделов TGStat?</h3><p>В первую очередь, после того как вы выбрали канал для анализа и провалились в него — нажмите на кнопку «Статистика», чтобы получить доступ к метрикам. И держите в голове правило:</p><blockquote><p>Нужно следить за контекстом, а не просто фиксировать изменения показателей. Находите объяснение каждому необычному выбросу. Иначе никак.</p></blockquote><p>А ещё важно учитывать, что&nbsp;<strong>TGStat отдельно считает просмотры для каждой картинки в посте — будьте внимательны.</strong></p><h3>Раздел «Сводная»</h3><p>Представляет из себя дашборд с основными показателями. Раздел удобно использовать для быстрого анализа состояния канала. Внутри «Сводной» можно найти такие чарты (графики и показатели):</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/2fb/19d/a46/2fb19da46760fb5581fbf11f3e7a8ac6.webp\" alt=\"Так выглядит сводный дашборд с данными о Telegram-канале в TGStat\" title=\"Так выглядит сводный дашборд с данными о Telegram-канале в TGStat\" width=\"1163\" height=\"703\"><figcaption>Так выглядит сводный дашборд с данными о Telegram-канале в TGStat</figcaption></figure><ul><li><p><strong>Подписчики.</strong>&nbsp;Показатель поможет оценить популярность канала и динамику изменения аудитории. Если видим плавный рост — скорее всего, над каналом работают правильно. Если видим резкий рост — предполагаем, что возможна накрутка. Если видим незначительное падение — не сильно переживаем. Если видим резкий отток аудитории — думаем по поводу прошедших накруток или резкого изменения формата канала.</p></li><li><p><strong>Подписки/отписки за 24 часа.</strong>&nbsp;Обращаем внимание на сильные выбросы. Если отписалось много людей в течение одного дня — смотрим на публикации, возможно, был выпущен пост на неудачную тему. Если видим взлёт подписок — возможно, канал заказывал в этот день рекламное размещение.</p></li><li><p><strong>Индекс цитирования.</strong>&nbsp;Если вы хотите оценить, насколько эффективно контент распространяется вирально — смотрите на этот показатель. Чем выше показатель, тем чаще публикации канал светится у других авторов.</p></li><li><p><strong>Средний охват 1 публикации.</strong>&nbsp;Полезно знать, чтобы оценивать, сколько людей в среднем видит посты канала. Косвенно указывает на вовлечённость аудитории в контент (через показатель ERR — о нём ниже).</p></li><li><p><strong>Средний рекламный охват 1 публикации.</strong>&nbsp;Это среднее число просмотров публикаций только внутри канала, без охватов с репостов. Метрика поможет более объективно оценить, сколько людей смотрят контент именно в этом канале.</p></li><li><p><strong>Возраст канала.</strong>&nbsp;Кажется, если взять несколько каналов с похожими показателями и посмотреть на их возраст, то можно выявить примерный временной диапазон, в рамках которого можно достигнуть определённых результатов по подписчикам, среднему охвату и т. п.</p></li><li><p><strong>Публикации.</strong>&nbsp;Глубокого смысла метрика не таит. Правда, она может подсказать, сколько постов стоит публиковать на вашем проекте. Для этого посмотрите на количество публикаций за месяц у ряда успешных конкурентов.</p></li><li><p><strong>Подписчиков читают посты канала (средний охват 1 публикации / количество подписчиков * 100%).</strong>&nbsp;С помощью показателя можно оценить, какая часть аудитории действительно активно следит за публикациями. В Telegram такая метрика обозначается как ERR.</p></li></ul><h3>Раздел «Подписчики»</h3><p>Здесь можно более детально определить, как изменялось число подписчиков с течением времени. Советую обратить внимание на выбросы — с их помощью можно определить, когда размещались успешные рекламные интеграции (рост числа подписчиков) или использовались неуместные темы в контенте (снижение числа подписчиков) .</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/36a/210/809/36a210809549ab749814664f0589d6a4.webp\" alt=\"Пример графика изменения числа подписчиков\" title=\"Пример графика изменения числа подписчиков\" width=\"1145\" height=\"378\"><figcaption>Пример графика изменения числа подписчиков</figcaption></figure><p>Теоретически, если взять несколько конкурентов из одной ниши и посмотреть на их графики изменения числа подписчиков — можно определить средний темп прироста для некоторых диапазонов подписчиков. Например, если у канала 10-25 тысяч подписчиков — его аудитория, в среднем, растёт на 1,2% в день. Так вы сможете заранее примерно спрогнозировать рост собственного канала на каждом из этапов продвижения.</p><h3>Раздел «Индекс цитирования»</h3><p>Кроме самого индекса, который отражает виральность контента, наверху страницы отмечено число упоминаний и репостов. Под «упоминанием» подразумевается появление где-то в Telegram логина вашего канала в формате «@example». А под репостом — пересылка отдельной публикации. Экспериментально, можно заложить более глубокую разницу между этими двумя понятиями:</p><ul><li><p>упоминание канала — появляется, когда человек считает, что упоминаемый канал регулярно публикует полезные и интересные материалы.</p></li><li><p>репост публикации — появляется, когда отдельная контентная единица понравилась подписчику канала.</p></li></ul><p>То есть,&nbsp;<strong>не рекламное упоминание является более «сильной» реакцией, чем репост</strong>&nbsp;— потому что указывает на постоянный сильный интерес ко всему каналу в целом. А репост — отражает интерес только к одной из публикаций канала.</p><p>Дополнительно упоминания исследуются внутри 4 чартов:</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/c76/09a/0a8/c7609a0a83e421a13255a9228395b528.webp\" alt=\"Основное содержание раздела «Индекс цитирования» в TGStat\" title=\"Основное содержание раздела «Индекс цитирования» в TGStat\" width=\"1116\" height=\"723\"><figcaption>Основное содержание раздела «Индекс цитирования» в TGStat</figcaption></figure><ul><li><p><strong>Упоминания по типу.</strong>&nbsp;Учитывается контекст упоминания. Индивидуальные — самые «сильные», потому что привлекают внимание только к вашему каналу. В подборки же канал может попадать просто для количества.</p></li><li><p><strong>Упоминания по количеству подписчиков.</strong>&nbsp;Чем более крупный канал вас упоминает — тем лучше. Особо глубоких выводов из этого чарта сделать не получится.</p></li><li><p><strong>Упоминания по тематикам.</strong>&nbsp;Чарт может быть полезен, если ваш канал размыт между несколькими направлениями. Посмотрев на распределение упоминаний можно примерно определить, какое тематическое направление наиболее заинтересовано в вашем контенте.</p></li><li><p><strong>Упоминание по странам.</strong>&nbsp;Ситуативна полезный чарт. Если для вас важна геолокация ваших наиболее вовлечённых пользователей — ориентируйтесь на чарт.</p></li></ul><h3>Раздел «Цитирование»</h3><p>На старте раздела есть схема, которая поможет определить, какие каналы чаще всего упоминают исследуемый канал (слева) и какие каналы чаще всего упоминаются самим исследуемым каналом (справа) . Как вариант, с её помощью можете определить, где вас любят больше всего и предложить коллаборацию.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/34a/7c3/4ce/34a7c34ce79b9e4612866edc29c5388b.webp\" alt=\"Пример схемы распределения упоминаний канала в TGStat\" title=\"Пример схемы распределения упоминаний канала в TGStat\" width=\"1139\" height=\"613\"><figcaption>Пример схемы распределения упоминаний канала в TGStat</figcaption></figure><p>Дополнительно можно посмотреть последние упоминания в каналах и чатах. Теоретически, это может быть полезно, если вы хотите оперативно приходить туда, где вас репостили и коммуницировать с аудиторией.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/6b4/1d0/b21/6b41d0b216e03e04e8b92f0987a18d8a.webp\" alt=\"Пример последних упоминаний канала\" title=\"Пример последних упоминаний канала\" width=\"1140\" height=\"381\"><figcaption>Пример последних упоминаний канала</figcaption></figure><h3>Раздел «Охваты публикаций»</h3><p>Вмещает в себя три чарта:</p><ul><li><p>Средний охват публикации.</p></li><li><p>Средний рекламный охват публикации.</p></li><li><p>Просмотры публикаций суммарно по дням.</p></li></ul><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/1e3/5f9/d6c/1e35f9d6c51ff938d22ee6d2f1b46b9c.webp\" alt=\"Пример графиков с изменением охватов и просмотров внутри канала\" title=\"Пример графиков с изменением охватов и просмотров внутри канала\" width=\"1172\" height=\"718\"><figcaption>Пример графиков с изменением охватов и просмотров внутри канала</figcaption></figure><p>О каждом из этих показателей рассказывал в разделе о «Сводной». Единственное дополнение: если посмотреть на просмотры публикаций суммарно по дням, при условии одинакового количество публикуемых постов, то можно выделить дни недели, в которые подписчики более активно взаимодействуют с каналом.</p><h3>Раздел «Анализ просмотров»</h3><p>Основная информацию отсюда — динамика просмотров постов по часам. С её помощью можно:</p><ul><li><p><strong>определить удачные часы для публикации.</strong>&nbsp;Например, если пост набирает больше 35% в первый час — считаем время публикации удачным. А если меньше — то пересматриваем время для постинга, чтобы уведомление от нашего канала не сбивалось конкурентами.</p></li><li><p><strong>выявить накрутку.</strong>&nbsp;Например, если за один час (не обязательно первый) пост набрал 80% просмотров — это подозрительно. Оцените регулярность таких странностей и сделайте выводы.</p></li></ul><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/487/4f8/330/4874f8330af0af69393967738a65e544.webp\" alt=\"Пример статистики просмотров по постам канала в TGStat\" title=\"Пример статистики просмотров по постам канала в TGStat\" width=\"1098\" height=\"549\"><figcaption>Пример статистики просмотров по постам канала в TGStat</figcaption></figure><h3>Раздел «Эффективность рекламы»</h3><p>Здесь отображаются те публикации, в которых были упомянуты сторонние каналы. Внимательно стоит смотреть на два параметра, которые помогут оценить эффективность рекламных постов:</p><ul><li><p><strong>просмотры.</strong>&nbsp;С ними всё понятно.</p></li><li><p><strong>прирост подписчиков.</strong>&nbsp;Показывает, на сколько подписчиков вырос рекламируемый канал за время жизни поста.</p></li></ul><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/8be/04f/1f6/8be04f1f6a2658de002c7348a9ec3811.webp\" alt=\"Пример статистики по рекламным размещениям в канале от TGStat\" title=\"Пример статистики по рекламным размещениям в канале от TGStat\" width=\"1096\" height=\"463\"><figcaption>Пример статистики по рекламным размещениям в канале от TGStat</figcaption></figure><h3>Раздел «Привлечение подписчиков»</h3><p>Поможет оценить, как канал привлекает трафик.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/b4b/9be/879/b4b9be8795fe5a2df05b7f46560a4ae6.webp\" alt=\"Пример таблицы из раздела «Привлечение подписчиков» в TGStat\" title=\"Пример таблицы из раздела «Привлечение подписчиков» в TGStat\" width=\"1039\" height=\"481\"><figcaption>Пример таблицы из раздела «Привлечение подписчиков» в TGStat</figcaption></figure><p>Есть такие данные:</p><ul><li><p>количество упоминаний канала за месяц.</p></li><li><p>суммарный месячный охват упоминаний.</p></li><li><p>прирост подписчиков.</p></li></ul><p>В зависимости от задачи, нужно смотреть на соотношение числа упоминаний канала и охвата или прироста подписчиков. Таким образом, можно будет косвенно оценить:</p><ul><li><p>как упоминания повлияли на популярность канала?</p></li><li><p>какой объём подписчиков удалось привлечь через упоминания?</p></li></ul><h3>Раздел «Внешний трафик»</h3><p>Может помочь понять, откуда идут переходы в исследуемый канал. Пример использования: смотрим распределение трафика по внешним источникам, выявляем перспективные и отстающие, оптимизируем бюджет на продвижение.</p><p>Есть важная оговорка:&nbsp;<strong>учитываются только те переходы, которые были осуществлены через редирект-сервис&nbsp;</strong><a href=\"https://ttttt.me/\" rel=\"noopener noreferrer nofollow\"><strong>ttttt. me</strong></a><strong>.</strong></p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/43f/389/ef9/43f389ef9cc7a11191edbc8c9f205efc.webp\" alt=\"Пример чартов в разделе «Внешний трафик»\" title=\"Пример чартов в разделе «Внешний трафик»\" width=\"1113\" height=\"680\"><figcaption>Пример чартов в разделе «Внешний трафик»</figcaption></figure><h3>Раздел «Топ публикаций»</h3><p>Раньше нельзя было составить топ публикаций и это очень бесило. Теперь же в TGStat можно не просто посмотреть самые просматриваемые посты, но и составить топы по пересылкам, репостам (пересылки без личных сообщений) , комментариям, реакциям.</p><figure class=\"\"><img src=\"https://habrastorage.org/getpro/habr/upload_files/91a/a7c/4b5/91aa7c4b597ed8da96f5f858029471ec.webp\" alt=\"Пример топа публикаций по реакциям\" title=\"Пример топа публикаций по реакциям\" width=\"427\" height=\"352\"><figcaption>Пример топа публикаций по реакциям</figcaption></figure><p>Ориентируясь на топовые публикации можно предположить, какие тематики и форматы лучше всего вовлекают аудиторию. Далее стоит попробовать их масштабировать и последить за результатами.</p><h3>Раздел «График публикаций»</h3><p>Может быть полезен, если вы хотите посмотреть, когда успешный конкурент публикует посты. Или хотите поэкспериментировать с собственным временем публикации контента.</p><figure class=\"full-width \"><img src=\"https://habrastorage.org/getpro/habr/upload_files/092/a54/ef0/092a54ef093e8db5bfc1f7f31dd27bfa.webp\" alt=\"Пример графика выхода публикаций\" title=\"Пример графика выхода публикаций\" width=\"863\" height=\"644\"><figcaption>Пример графика выхода публикаций</figcaption></figure><h3>Заключение</h3><p>TGStat серьёзно развился. Сейчас это сильнейшее решение для Telegram-аналитики с кучей возможностей. Но не забывайте главное правило:</p><blockquote><p>За показателями важно видеть смысл. Думайте не просто об изменении цифр, а о том почему они изменяются.</p></blockquote><p>Формулируйте правильные выводы, бережно относитесь к данным и работайте с умом.</p><p><em>А если вы хотите запустить контентный проект, разработать стратегию продвижения бренда в соцсетях или исследовать аудиторию — обращайтесь ко мне. Можно писать в&nbsp;</em><a href=\"https://t.me/tomilenkoman\" rel=\"noopener noreferrer nofollow\"><em>Telegram</em></a><em>, в&nbsp;</em><a href=\"https://vk.com/tomilenkoman\" rel=\"noopener noreferrer nofollow\"><em>ВКонтакте</em></a><em>&nbsp;или&nbsp;</em><a href=\"mailto:iktomilenko@gmail.com\" rel=\"noopener noreferrer nofollow\"><em>на почту</em></a><em>. Надеюсь, сработаемся)</em></p><p></p></div>",
      "create_date": "2022-06-09T14:32:33.446Z",
      "edit_date": "2022-06-10T14:32:33.446Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.article",
    "pk": 10,
    "fields": {
      "category": 2,
      "author": 1,
      "title": "Рациональный выбор системы управления тестированием",
      "image": "article_images/b4a24e33b3bd654540968ef0cfce7d49.png",
      "description": "<p><span style=\"color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif; font-size: 16px;\">Начну с текущего положения дел: ДОМ.РФ и Банк ДОМ.РФ уже два года успешно используют систему управления тестированием — Test IT. На момент написания статьи в системе Test IT ведутся 35 проектов (систем), создано более 25,5 тысяч ручных и автотестов и выполнено более 600 тысяч прогонов (90% из которых — это запуски автотестов).</span></p><p><span style=\"color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif; font-size: 16px;\"><br></span><span style=\"color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif; font-size: 16px;\">Но вернемся на 2,5 года назад, во вторую половину 2019 года, когда мы только начинали внедрять практики по тестированию, и перед нами стоял выбор централизованной системы управления тестированием (далее TMS — от Test Management System), т.к. большая часть команд или не вела тест-кейсы, или вела их в разрозненных инструментах, в том числе в Word/Excel.</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Тогда задача централизовать управление тестированием была одной из ключевых, и после презентации плюсов такой централизации удалось обосновать, что компании требуется единое хранилище тестов и общий инструмент для работы QA-команды.</p><p style=\"text-align: center; transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><img src=\"/media/django-summernote/2022-06-22/5098383a-76da-4326-a370-4ee13785936a.png\" style=\"width: 729px;\"><br></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Для выбора инструмента мы организовали небольшую рабочую группу из QA-Lead’ов по самым развитым продуктовым направлениям. И чтобы выбрать достойный инструмент, при этом ещё и соблюсти все особенности законодательства в части закупок, нашей группе сначала потребовалось ответить себе на следующие вопросы:</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;;\">«Каким списком ограничить сравнение инструментов?»</em>&nbsp;— досконально сравнивать их все нет ни времени, ни ресурсов;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;;\">«Какие функции у целевого решения для нас являются наиболее важными?»</em>&nbsp;— опять же, сравнивать все функции долго;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;;\">«Какой бюджет потребуется для старта и пилота, а затем для перевода всех наших команд на централизованный инструмент?»&nbsp;</em>— для закупок стоимость решения является важным параметром и будет иметь в конкурсе высокий вес.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">&nbsp;«Каким списком ограничить сравнение инструментов?»</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">У нашей рабочей группы был опыт работы с разными инструментами управления тестированием, от простого Open Source решения TestLink до дорогого и огромного HP ALM (теперь уже Micro Focus ALM, далее MF ALM). Поэтому для начала мы выписали те инструменты, с которыми наша группа была уже знакома и готова была с ними работать, или у которых была возможность установить пробную версию для изучения.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Помимо этого, на тот момент (осень 2019 года) тема импортозамещения была уже актуальной для ДОМ.РФ и Банка ДОМ.РФ, и поэтому мы задались ещё одним вопросом:</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;;\">«А есть ли на рынке отечественного ПО решение, которое могло бы подойти нам для наших нужд?»</em></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Ранее никто из нас не сталкивался с отечественными TMS, и нам потребовалось некоторое время на исследование этого вопроса. Ответ нас приятно удивил, т.к. после небольшого исследования мы находим ссылку на молодой (на тот момент) российский проект компании Test IT, которая как раз в то время подаёт заявку на включение их программного обеспечения в реестр отечественного ПО.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">В итоге в наш список систем для сравнения вошли:</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; TestRail</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; TestLink</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; JIRA + Zephyr</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Test IT</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MF ALM</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Adaptavist Test Management</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">&nbsp;<span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">«Какие функции у целевого решения для нас являются наиболее важными?»</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Этот вопрос решает сразу два момента. Первый — нам нужно было сравнить инструменты и понять, какой инструмент нам подходит больше, а какой меньше. Второй — что для выбора корректного инструмента и формирования ТЗ на закупку нам требовалось описать в нем функции инструмента, которые для нас будут ключевыми и без которых мы не готовы рассматривать инструмент. В противном случае нам могли бы продать, например, OpenOffice Calc с макросами и какой-нибудь домашней надстройкой.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Я специально не буду сейчас изменять и адаптировать тот список функций и критериев, который получился у нас тогда, в конце 2019 года, т.к. это были наши взгляды на тот момент и корректировать их сейчас по итогам более двухлетнего опыта использования конкретного инструмента было бы не корректно. Допускаю, что сегодня данные критерии или результаты сравнения могут выглядеть уже неактуально.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Итого список ключевых для нас функций и критериев сравнения выглядел следующим образом:</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Хранение и редактирование тест-кейсов;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Древовидное создание тест-кейсов;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Вложение скриншотов (Подтверждения тестирования) к прохождению тест-кейса;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Шаги воспроизведения, соответствующие ожидаемому результату при написании TC&nbsp;<em style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;;\">(прим. Редакции: ТС&nbsp;</em>—&nbsp;<em style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;;\">Test Case)</em>;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Добавление требований к тест-плану, кейсам, тестовому набору;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Группировка множества тест-кейсов в тест прогон (из разных папок);</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Создание Test Runs (тестовых прогонов);</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Создание Test Suites (тестовых наборов);</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Импорт, экспорт тест-кейсов (Excel);</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">10.&nbsp;&nbsp; Возможность создание связей с дефектами;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">11.&nbsp;&nbsp; Поиск, фильтрация, сортировка сущностей (тест-кейсы, прогоны, планы);</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">12.&nbsp;&nbsp; Формирование статистики прогона и визуализация результатов прохождения по статусам (по всему прогону);</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">13.&nbsp;&nbsp; Формирование отчетов прогона;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">14.&nbsp;&nbsp; Интерактивность отчетов, статистики с получением выгрузки тестов, дефектов, требований;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">15.&nbsp;&nbsp; Ролевая модель с различным уровнем доступа к проектам;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">16.&nbsp;&nbsp; Удобный пользовательский интерфейс;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">17.&nbsp;&nbsp; Интеграция с Jira;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">18.&nbsp;&nbsp; Управление запусками автотестов;</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">«Какой бюджет потребуется для старта и пилота, а затем для перевода всех наших команд на централизованный инструмент?»</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Для данного класса систем стоимость чаще всего зависит от количества пользователей, и поэтому для расчёта и сравнения стоимости в таблицу для сравнения был внесен ещё один пункт — это стоимость 100 лицензий на год.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Сразу оговорюсь, что от систем, которые базируются на количестве лицензий Jira, мы были вынуждены отказаться, т.к. количество лицензий Jira у нас сильно (примерно в 200 раз) превышает количество требуемых лицензий для системы управления тестированием.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">Таблица сравнения инструментов</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Составив список критериев и список систем, мы перешли к их изучению и сравнению. Итогом сравнения была следующая таблица:</p><figure class=\"full-width \" style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 32px; text-align: center; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif; font-size: 16px;\"><img src=\"https://habrastorage.org/r/w1560/getpro/habr/upload_files/ed2/957/9b3/ed29579b3f9e97af5ce90a4aec5ae82e.jpg\" width=\"1146\" height=\"557\" data-src=\"https://habrastorage.org/getpro/habr/upload_files/ed2/957/9b3/ed29579b3f9e97af5ce90a4aec5ae82e.jpg\" style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; border-style: none; quotes: &quot;«&quot; &quot;»&quot;; height: auto; margin: 0px; max-width: 100%; color: rgb(126, 110, 111); font-size: 0.75rem; font-style: italic; cursor: pointer;\"><figcaption style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; color: rgb(144, 144, 144); font-size: 0.8125rem; line-height: 1.125rem; margin-top: 4px; white-space: pre-wrap;\"></figcaption></figure><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 32px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">*Стоимость лицензий взята из открытых источников (интернет-магазины, официальные сайты разработчиков) на момент сравнения и была использована только для сравнения общих параметров (при перерасчёте использовался курс доллара 66,96 руб. т.к. это был первый квартал 2020 года).</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">**стоимость MF ALM получить до запуска процедуры закупки не удалось, т.к. все общения с представителями компании сводились к «индивидуальным предложениям».</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">Поддержка и доработка инструмента по требованиям</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">В ходе обсуждения и сравнения инструментов у нас часто возникали дискуссии на тему, а хорошо бы взять вот ту или иную удачную фичу из одного из инструментов и засунуть в другие. Поэтому в ТЗ на TMS мы так же добавили фразу «Осуществление доработок по запросу заказчика», которая для нас была важна.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Отмечу сразу, что у меня был опыт администрирования и коммуникации тогда ещё с HP по вопросам доработки HP ALM, процесс очень затянутый и добиться реального включения нужной фичи в релиз было очень-очень сложно.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Этот пункт также был в пользу Test IT.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">Выбор инструмента</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Из перечисленных инструментов достаточно неожиданно для рабочей группы приоритетными вариантами по функциям стали Test IT и, вполне ожидаемо, зарубежный MF ALM вместе с TestRail. Но ALM был в десятки раз дороже, а TestRail в два раза дороже.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Конкурс, который мы проводили, был открытым, и мы были готовы рассматривать все инструменты управления тестированием и взвешивать их согласно условиям конкурса. В итоге проведение такого конкурса показало, что выбор нашей рабочей группы совпал с рыночными предложениями и возможностями TMS на тот момент, и мы в 2020 году начали внедрение TMS Test IT в ДОМ.РФ и в Банке ДОМ.РФ, а к выходу пресс-релиза (<a href=\"https://sk.ru/news/domrf-perehodit-na-otechestvennuyu-tms-ot-rezidenta-skolkovo/\" style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; color: rgb(84, 142, 170);\">https://sk.ru/news/domrf-perehodit-na-otechestvennuyu-tms-ot-rezidenta-skolkovo/</a>) у нас уже было 6 проектов/АС, которые активно использовали Test IT.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\"><span style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; font-weight: bolder; quotes: &quot;«&quot; &quot;»&quot;; -webkit-font-smoothing: antialiased;\">Вместо заключения</span></p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Оборачиваясь на происходящее в 2022 году и вызванный этим отказ части зарубежных компаний от своих обязательств, можно с уверенностью сказать, что небольшой риск, на который мы пошли, выбрав молодое на тот момент решение от Test IT, оказался оправданным, и сейчас наша компания уже более двух лет успешно использует инструмент для управления тестированием, на который другие компании только начинают переезжать.</p><p style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; margin-top: 24px; margin-bottom: 0px; padding: 0px; font-size: 16px; line-height: 1.5rem; color: rgb(17, 17, 17); font-family: -apple-system, BlinkMacSystemFont, Arial, sans-serif;\">Кстати, мы при желании готовы провести референс-визит и более детально рассказать наш опыт работы с Test IT. Если кому-то интересно, то для этого лучше и быстрее будет обратиться напрямую в Test IT (<a href=\"https://testit.software/\" style=\"transition: opacity 0.2s ease-in-out 0s, color 0.2s ease-in-out 0s, text-decoration 0.2s ease-in-out 0s, background-color 0.2s ease-in-out 0s, -webkit-text-decoration 0.2s ease-in-out 0s; quotes: &quot;«&quot; &quot;»&quot;; color: rgb(84, 142, 170);\">https://testit.software/</a>).</p>",
      "create_date": "2022-06-22T07:48:32.084Z",
      "edit_date": "2022-06-25T16:46:57.462Z",
      "is_deleted": false,
      "is_published": true,
      "for_moderation": false
    }
  },
  {
    "model": "mainapp.comment",
    "pk": 1,
    "fields": {
      "path": "000000001",
      "level": 0,
      "create_date": "2022-06-17T14:32:33.446Z",
      "edit_date": "2022-06-17T14:32:33.446Z",
      "comment_body": "Классная статья",
      "author": 3,
      "article": 10
    }
  },
  {
    "model": "mainapp.comment",
    "pk": 2,
    "fields": {
      "path": "000000001.000000002",
      "level": 1,
      "create_date": "2022-06-17T14:32:33.446Z",
      "edit_date": "2022-06-17T14:32:33.446Z",
      "comment_body": "Согласен",
      "author": 2,
      "article": 10
    }
  },
  {
    "model": "mainapp.comment",
    "pk": 3,
    "fields": {
      "path": "000000001.000000002.000000003",
      "level": 2,
      "create_date": "2022-06-17T14:32:33.446Z",
      "edit_date": "2022-06-17T14:32:33.446Z",
      "comment_body": "Супер!",
      "author": 3,
      "article": 10
    }
  },
  {
    "model": "mainapp.comment",
    "pk": 18,
    "fields": {
      "path": "000000001.000000018",
      "level": 1,
      "create_date": "2022-07-02T11:32:26.394Z",
      "edit_date": "2022-07-02T11:32:26.399Z",
      "comment_body": "Спасибо",
      "author": 1,
      "article": 10
    }
  },
  {
    "model": "mainapp.comment",
    "pk": 22,
    "fields": {
      "path": "000000001.000000022",
      "level": 1,
      "create_date": "2022-07-02T16:31:04.852Z",
      "edit_date": "2022-07-02T16:31:04.858Z",
      "comment_body": "Спасибо",
      "author": 1,
      "article": 10
    }
  },
  {
    "model": "authapp.customuser",
    "pk": 1,
    "fields": {
      "password": "pbkdf2_sha256$260000$6MCgWWTblZMRAWXcje46eH$VftpG23HxO7YP6ELkXf9ZbXIL782RgM/CJin/ZgTYvI=",
      "last_login": "2022-07-02T16:30:31.897Z",
      "is_superuser": true,
      "username": "scrum",
      "first_name": "Маргарет",
      "last_name": "Гулд",
      "email": "scrum@scruma.net",
      "is_staff": true,
      "is_active": true,
      "date_joined": "2022-06-18T07:28:33.611Z",
      "age": 18,
      "avatar": "users_avatars/portfolio.jpg.jpeg",
      "activation_key": "",
      "activation_key_expires": "2022-06-20T07:28:12.344Z",
      "groups": [],
      "user_permissions": []
    }
  },
  {
    "model": "authapp.customuser",
    "pk": 2,
    "fields": {
      "password": "pbkdf2_sha256$260000$1WpyZMBQw4FsufZGG9Mbuj$hyWu/CixLKilDz993tHfQFxNjJ4iyUReltfwrT9L4Uk=",
      "last_login": "2022-06-24T20:21:15.615Z",
      "is_superuser": false,
      "username": "Pavel",
      "first_name": "Павел",
      "last_name": "Пирогов",
      "email": "2987026@mail.ru",
      "is_staff": true,
      "is_active": true,
      "date_joined": "2022-06-18T19:54:31.975Z",
      "age": 18,
      "avatar": "users_avatars/shrine20211219-38-s1rgmx.jpg",
      "activation_key": "",
      "activation_key_expires": "2022-06-20T19:54:11.650Z",
      "groups": [],
      "user_permissions": []
    }
  },
  {
    "model": "authapp.customuser",
    "pk": 3,
    "fields": {
      "password": "pbkdf2_sha256$260000$92YrVJsltJS61EloJqZTtI$a7Mn5BpJioGvWB6GeELpP+QG+cRC/Y9hulTi8QYNCmU=",
      "last_login": null,
      "is_superuser": false,
      "username": "Oleg_m",
      "first_name": "Олег",
      "last_name": "Маслов",
      "email": "maslov@gb.ru",
      "is_staff": false,
      "is_active": true,
      "date_joined": "2022-06-24T20:14:19.426Z",
      "age": 18,
      "avatar": "users_avatars/shrine20200217-114-vyvskh.jpg",
      "activation_key": "",
      "activation_key_expires": "2022-06-26T20:05:18.831Z",
      "groups": [],
      "user_permissions": []
    }
  },
  {
    "model": "authapp.customuserprofile",
    "pk": 1,
    "fields": {
      "user": 1,
      "about_me": "Маргарет Гулд Стюарт в настоящее время работает директором по дизайну продуктов в Facebook. Ранее она занимала должность директора по работе с пользователями на YouTube. До этого она провела два года, руководя поиском и UX потребительских товаров в Google. Маргарет уже более 15 лет является ведущим специалистом и менеджером в области пользовательского опыта.",
      "gender": "F"
    }
  },
  {
    "model": "authapp.customuserprofile",
    "pk": 2,
    "fields": {
      "user": 2,
      "about_me": "Руководитель IT проектов, со стажем более 9 лет. Специализируюсь на управлении проектами по цифровой трансформации, IT проектами по разработке и внедрению программного обеспечения и инфраструктуре. В своей практике использую как классические подходы к управлению проектами, к примеру по методологии PMBoK, так и гибкие походы, например фреймворк Scrum",
      "gender": "M"
    }
  },
  {
    "model": "authapp.customuserprofile",
    "pk": 3,
    "fields": {
      "user": 3,
      "about_me": "Окончил факультет информационных технологий АлтГТУ по специальности «программное обеспечение вычислительной техники». Разрабатывал и поддерживал высоконагруженные проекты в различных сферах, в том числе финтех, криптовалютные проекты и разработку нейронной сети.",
      "gender": "M"
    }
  }
]